[{"asin": "0002007770", "title": "Water For Elephants", "description": NaN}, {"asin": "0002219417", "title": "The Winds of War", "description": "Herman Wouk&#x2019;s acclaimed novels include the Pulitzer Prize&#x2013;winning The Caine Mutiny; Marjorie Morningstar; Don&#x2019;t Stop the Carnival; Youngblood Hawke; The Winds of War; War and Remembrance; Inside, Outside; The Hope; and The Glory.--This text refers to theAudio CDedition."}, {"asin": "0002247399", "title": "A Dance with Dragons", "description": NaN}, {"asin": "000221685X", "title": "the queen's confession", "description": NaN}, {"asin": "0002726874", "title": "Quartered Safe Out Here: A Recollection of the War in Burma", "description": "\"There is no doubt that it is one of the great personal memoirs of the Second World War.\"  --John Keegan&#8220;Fraser manages to capture the flavor of his comrades while so vividly portraying the grittiness of combat.&#8221;   --The Historical Novel Society--This text refers to an out of print or unavailable edition of this title."}, {"asin": "0006178979", "title": "The Queen's Secret", "description": NaN}, {"asin": "000616823X", "title": "Endless Night (The Christie Collection)", "description": NaN}, {"asin": "000639325X", "title": "Dark Places", "description": NaN}, {"asin": "0006479758", "title": "EXECUTIVE ORDERS", "description": NaN}, {"asin": "0006478840", "title": "The Rose Without a Thorn", "description": NaN}, {"asin": "0006476155", "title": "Along Came a Spider", "description": "This second big winter thriller by a writer named Patterson (see Fiction Forecasts, Oct. 19) features a villain (a multiple-personality serial killer/kidnapper) whom the publisher hopes will remind readers of Thomas Harris's Hannibal Lecter, and a hero who is compared to those of Jonathan Kellerman. Unfortunately, the novel has few merits of its own to set against those authors' works. Hero Alex Cross is in fact a black senior detective in Washington, D.C., who is also a psychiatrist and has a facile but not entirely convincing line of sentimental-cynical patter. The villain is Gary Soneji/Murphy (read Hyde/Jekyll), who kills for recognition, and finally kidnaps the kids of prominent parents. Alex is soon on the case, more enraged by Gary's killing of poor ghetto blacks than by the Lindbergh-inspired kidnapping, and becomes involved with a gorgeous, motorcycle-riding Secret Service supervisor who is not what she seems. Soneji/Murphy is eventually captured--but can the bad part of him be proven guilty? There is even a hint at the end that he may survive for a sequel, though the reader has virtually forgotten him by then. Spider reads fluently enough, but its action and characters seem to have come out of some movie-inspired never-never land. If a contemporary would-be nail-biter is to thrill as it should, it urgently needs stronger connections to reality than this book has. Come back, Thomas Harris! 150,000 first printing; Literary Guild main selection.Copyright 1992 Reed Business Information, Inc.--This text refers to theHardcoveredition."}, {"asin": "000649692X", "title": "Glamorous Powers", "description": "Jon Darrow, an Anglican priest and abbot with psychic abilities, has a vision that he interprets as God's instruction to leave his religious order. \"In this witty, wise novel, the question 'Does God exist?' is always understood and, true to life, ambiguously answered,\" wrote PW.Copyright 1989 Reed Business Information, Inc.--This text refers to an out of print or unavailable edition of this title."}, {"asin": "0006499163", "title": "Post Captain", "description": NaN}, {"asin": "0006514006", "title": "The Other Boleyn Girl", "description": "Sisterly rivalry is the basis of this fresh, wonderfully vivid retelling of the story of Anne Boleyn. Anne, her sister Mary and their brother George are all brought to the king's court at a young age, as players in their uncle's plans to advance the family's fortunes. Mary, the sweet, blond sister, wins King Henry VIII's favor when she is barely 14 and already married to one of his courtiers. Their affair lasts several years, and she gives Henry a daughter and a son. But her dark, clever, scheming sister, Anne, insinuates herself into Henry's graces, styling herself as his adviser and confidant. Soon she displaces Mary as his lover and begins her machinations to rid him of his wife, Katherine of Aragon. This is only the beginning of the intrigue that Gregory so handily chronicles, capturing beautifully the mingled hate and nearly incestuous love Anne, Mary and George (\"kin and enemies all at once\") feel for each other and the toll their family's ambition takes on them. Mary, the story's narrator, is the most sympathetic of the siblings, but even she is twisted by the demands of power and status; charming George, an able plotter, finally brings disaster on his own head by falling in love with a male courtier. Anne, most tormented of all, is ruthless in her drive to become queen, and then to give Henry a male heir. Rather than settling for a picturesque rendering of court life, Gregory conveys its claustrophobic, all-consuming nature with consummate skill. In the end, Anne's famous, tragic end is offset by Mary's happier fate, but the self-defeating folly of the quest for power lingers longest in the reader's mind.Copyright 2002 Cahners Business Information, Inc.--This text refers to an alternatePaperbackedition."}, {"asin": "0006514642", "title": "The Wise Woman", "description": "The author of the Wideacre trilogy offers another intense, absorbing tale, a grisly drama of passion and witchcraft in 16th-century England. Growing up as an ill-used apprentice to Morach, the much-feared wise woman of the moors, Alys finds respite by joining an order of Catholic nuns. When young Lord Hugo and his men burn the abbey to the ground during a drunken rampage, Alys is the only one to escape; she flees back to Morach, consumed with guilt at having abandoned her dying sisters. Summoned to minister to Lord Hugh, Hugo's father, Alys soon finds herself deeply involved in the treachery and intrigue surrounding the old man's attempts to have his son's marriage to the barren Lady Catherine annulled. Attracted to Hugo despite his murderous past, Alys begins to practice witchcraft in earnest to rid him of Catherine and become his wife. Her spells work all too well: Catherine's long-awaited pregnancy ends disastrously, and Hugo comes to love Alys, but in a sickly haze of lust that provides no basis for marriage. Alys soon finds herself so sunk in evil, so removed from God's love, that only a truly shocking gesture can bring about her salvation. Gregory adeptly manipulates hair-raising horror and mounting suspense, brilliantly evoking the period's turbulent atmosphere. Dou ble day Book Club alternate.Copyright 1993 Reed Business Information, Inc.--This text refers to an out of print or unavailable edition of this title."}, {"asin": "0006492460", "title": "Growing Up with Dick and Jane: Learning and Living the American Dream", "description": "Growing up with Dick and Janeis a simply presented but often amusing analysis of American popular culture and educational theories through the looking glass of the Dick and Jane readers. The book is a visual treat, with a layout that looks likeWiredmagazine for preschoolers. However, the real reward comes at the end: packaged into a pocket on the inside back cover is a small volume reprinting five classic Dick and Jane tales, includingLook,See It Go,andSomething Blue for Puff."}, {"asin": "0006514359", "title": "Day of Reckoning (Sean Dillon Series)", "description": "In Jack Higgins's new Mafia, no one wears gold chains or carries a tommy gun. Deals are done quietly and often resemble those in the \"legal\" business world. In fact, the tentacles of the Cosa Nostra extend into the most public of industries, including TV, film, and publishing. WhenTruthmagazine reporter Katherine Johnson starts looking too closely at the life of millionaire socialite and mob boss Jack Fox, however, the veneer of gentility dissolves immediately. Her body is found one morning floating in the East River, and the coroner suspects foul play.Wrenched by the pain of his loss, her ex-husband--former FBI agent Blake Johnson--decides to take the law into his own hands. In fact, as part of the secret White House department known as The Basement, Blake actually has the president's permission to take out Fox in the best way he sees fit. As Blake begins his Fox hunt,Day of Reckoningevolves into an international duel between the masterminds of justice and criminality. Blake struggles to exact his revenge by slowly undermining his opponents' businesses. And Fox matches him at every turn.While the contest between the power brokers is compelling on the surface, Higgins is unable to infuse his characters with enough life to make the story as engaging as it might have been. The heroes and villains borrow heavily from the classic James Bond play book, complete with brandy snifters, brandname cigarettes, Saville Row suits, and secret, world-dominating empires. It's fun to read as a sort of homage to thrillers of the early Cold War period, butDay of Reckoningnever matches the success of such earlier Higgins greats asThe Eagle Has Landedand seems to fall all too frequently into clich&eacute;.--Patrick O'Kelley--This text refers to an out of print or unavailable edition of this title."}, {"asin": "0006511252", "title": "The Flashman: from the Flashman Papers, 1839-42", "description": "'The Flashman Papers do what all great sagas do - winning new admirers along the way but never, ever betraying old ones. It is an immense achievement.' Sunday Telegraph 'Not so much a march as a full-blooded charge, fortified by the usual lashings of salty sex, meticulously choreographed battle scenes and hilariously spineless acts of self preservation by Flashman.' Sunday Times 'Not only are the Flashman books extremely funny, but they give meticulous care to authenticity. You can, between the guffaws, learn from them.' Washington Post 'A first-rate historical novelist' Kingsley Amis"}, {"asin": "0006551807", "title": "The Namesake", "description": "Any talk ofThe Namesake--Jhumpa Lahiri's follow-up to her Pulitzer Prize-winning debut,Interpreter of Maladies--must begin with a name: Gogol Ganguli. Born to an Indian academic and his wife, Gogol is afflicted from birth with a name that is neither Indian nor American nor even really a first name at all. He is given the name by his father who, before he came to America to study at MIT, was almost killed in a train wreck in India. Rescuers caught sight of the volume of Nikolai Gogol's short stories that he held, and hauled him from the train. Ashoke gives his American-born son the name as a kind of placeholder, and the awkward thing sticks.Awkwardness is Gogol's birthright. He grows up a bright American boy, goes to Yale, has pretty girlfriends, becomes a successful architect, but like many second-generation immigrants, he can never quite find his place in the world. There's a lovely section where he dates a wealthy, cultured young Manhattan woman who lives with her charming parents. They fold Gogol into their easy, elegant life, but even here he can find no peace and he breaks off the relationship.  His mother finally sets him up on a blind date with the daughter of a Bengali friend, and Gogol thinks he has found his match. Moushumi, like Gogol, is at odds with the Indian-American world she inhabits. She has found, however, a circuitous escape: \"At Brown, her rebellion had been academic ... she'd pursued a double major in French. Immersing herself in a third language, a third culture, had been her refuge--she approached French, unlike things American or Indian, without guilt, or misgiving, or expectation of any kind.\" Lahiri documents these quiet rebellions and random longings with great sensitivity. There's no  cleverness or showing-off inThe Namesake, just beautifully confident storytelling. Gogol's story is neither comedy nor tragedy; it's simply that ordinary, hard-to-get-down-on-paper commodity: real life.--Claire Dederer--This text refers to an out of print or unavailable edition of this title."}, {"asin": "0006499945", "title": "Rough Justice", "description": "During the biggest snowstorm in the history of Philadelphia, the jury is out. The defense is confident of a verdict of not guilty, but then client Elliot Steere admits to his council that he is a murderer. Marta Richter does not take this revelation happily. In fact, she's so outraged that she wants her client's secret revealed no matter what it does to her career. Steere isn't about to let her blow his chances, and with powerful connections, money, and muscle, he works from his jail cell to silence Marta and her colleagues before the sequestered jury makes a decision. If readers like soap opera?type cliffhangers at the end of each chapter, a plot that reads like a TV script, and a little gory violence here and there, they will like this book. The characters are well thought out, but most often sequences of the story unfold implausibly, as when Marta hunts for clues in her client's house and boat. Attorney Bennie Rosato, the feisty character from a previous Scottoline novel (Legal Tender, LJ 7/96), makes an appearance here but is not very involved in the plot except for a \"save-the-day\" routine in the last few chapters. This is essential for readers already hooked on Scottoline, but don't start with this one when introducing her to readers.-?Shirley Gibson Coleman, Ann Arbor Dist. Lib., Mich.Copyright 1997 Reed Business Information, Inc.--This text refers to an out of print or unavailable edition of this title."}, {"asin": "0006550436", "title": "The Bonesetter's Daughter", "description": "At the beginning of Amy Tan's fourth novel, two packets of papers written in Chinese calligraphy fall into the hands of Ruth Young. One bundle is titledThings I Know Are Trueand the other,Things I Must Not Forget. The author? That would be the protagonist's mother, LuLing, who has been diagnosed with Alzheimer's disease. In these documents the elderly matriarch, born in China in 1916, has set down a record of her birth and family history, determined to keep the facts from vanishing as her mind deteriorates.A San Francisco career woman who makes her living by ghostwriting self-help books, Ruth has little idea of her mother's past or true identity. What's more, their relationship has tended to be an angry one. Still, Ruth recognizes the onset of LuLing's decline--along with her own remorse over past rancor--and hires a translator to decipher the packets. She also resolves to \"ask her mother to tell her about her life. For once, she would ask. She would listen. She would sit down and not be in a hurry or have anything else to do.\"Framed at either end by Ruth's chapters, the central portion ofThe Bonesetter's Daughtertakes place in China in the remote, mountainous region where anthropologists discovered Peking Man in the 1920s. Here superstition and tradition rule over a succession of tiny villages. And here LuLing grows up under the watchful eye of her hideously scarred nursemaid, Precious Auntie. As she makes clear, it's not an enviable setting:I noticed the ripe stench of a pig pasture, the pockmarked land dug up by dragon-bone dream-seekers, the holes in the walls, the mud by the wells, the dustiness of the unpaved roads. I saw how all the women we passed, young and old, had the same bland face, sleepy eyes that were mirrors of their sleepy minds.Nor is rural isolation the worst of it. LuLing's family, a clan of ink makers, believes itself cursed by its connection to a local doctor, who cooks up his potions and remedies from human bones. And indeed, a great deal of bad luck befalls the narrator and her sister GaoLing before they can finally engineer their escape from China. Along the way, familial squabbles erupt around every corner, particularly among mothers, daughters, and sisters. And as she did in her earlierThe Joy Luck Club, Amy Tan uses these conflicts to explore the intricate dynamic that exists between first-generation Americans and their immigrant elders.--Victoria Jenkins--This text refers to an out of print or unavailable edition of this title."}, {"asin": "0007106246", "title": "Fix-it Duck (Duck in the Truck)", "description": "The trouble begins with a leaky roof in the sequel to Duck in a Truck, Fix-It Duck by Jez Alborough, and follows the, er, handy quacker on a series of missteps.Copyright 2002 Cahners Business Information, Inc.--This text refers to theHardcoveredition."}, {"asin": "0007113080", "title": "The Bone Doll's Twin (Tamir Triad)", "description": "Young Tobin had the misfortune of being born female in perilous times, in which high-born females of all ages are being murdered by order of the king, to ensure his son's succession to the throne. Years earlier, King Elrius usurped his sister's rightful claim to the throne--an act that abrogated the divine protections set over his people, bringing plague and war to the land. There are those who would see the divine prophecies honored, however, and a warrior queen restored to the throne. So Tobin is disguised by means of dark magic that conceals her true gender with that of her twin brother, who was killed at birth, but not fast enough. He drew a single breath, which was enough to keep his soul earthbound and horribly angry. Tobin will indeed be queen, but only if she can be protected until adulthood from her insane mother, her demonic brother, and every evil wizard in the land. This terrific tale is dark and exciting, and the magic in it is truly wonderful.Paula LuedtkeCopyright &#169; American Library Association. All rights reserved--This text refers to theMass Market Paperbackedition."}, {"asin": "0007119267", "title": "Evil Under the Sun (Poirot)", "description": "Considered by many to be one of the very best Agatha Christie mysteries, this macabre tale has lost none of its crisp intrigue since it was first published in 1940. Using a plot formula that has since become a mystery standard, Christie conveniently gathers all the characters in one hard-to-leave location, in this case, the Jolly Roger, a vacation hotel on the southern coast of England. One of the guests, a gorgeous, dramatic flirt, is strangled to death, and the famous detective Hercule Poirot who happens to be vacationing at the Jolly Roger, too sets out to solve the case. Each of the well-developed characters is suspect, and listeners will constantly be changing their bets as to whodunit. British stage actor Suchet, who many know as the definitive Poirot from the Public Television Mystery! series was an obvious choice for the reader of this production, having won an Audie award for reading Christie's Mysterious Affair at Styles in 1997. Suchet gives an outstanding and highly entertaining performance, obviously taking great zeal in the task of fleshing out Christie's colorful lot of characters.Copyright 2002 Cahners Business Information, Inc.--This text refers to an out of print or unavailable edition of this title."}, {"asin": "0007111509", "title": "Partners in Crime (Tommy &amp; Tuppence Chronology)", "description": "'Required reading.' Books 'Distinctly worthwhile.' New York Times 'Sherlock Holmes, John Thorndyke, Father Brown and even Poirot are amiably parodied, and once or twice the solution as well as the dialogue is deliberately facetious.' Times Literary Supplement"}, {"asin": "0007124015", "title": "The Lord of the Rings", "description": "A Christian can almost be forgiven for not reading the Bible, but there's no salvation for a fantasy fan who hasn't read the gospel of the genre, J.R.R. Tolkien's definitive three-book epic, the Lord of the Rings (encompassingThe Fellowship of the Ring,The Two Towers, andThe Return of the King), and its charming precursor,The Hobbit. That many (if not most) fantasy works are in some way derivative of Tolkien is understood, but the influence of the Lord of the Rings is so universal that everybody from George Lucas to Led Zeppelin has appropriated it for one purpose or another.Not just revolutionary because it was groundbreaking, the Lord of the Rings is timeless because it's the product of a truly top-shelf mind. Tolkien was a distinguished linguist and Oxford scholar of dead languages, with strong ideas about the importance of myth and story and a deep appreciation of nature. His epic, 10 years in the making, recounts the Great War of the Ring and the closing of Middle-Earth's Third Age, a time when magic begins to fade from the world and men rise to dominance. Tolkien carefully details this transition with tremendous skill and love, creating in the Lord of the Rings a universal and all-embracing tale, a justly celebrated classic.--Paul Hughes--This text refers to an out of print or unavailable edition of this title."}, {"asin": "0007116055", "title": "The Devil and Miss Prym", "description": "New to the U.S. but first published in Europe in 1992, Coelho's latest (following the bestsellingThe Zahir) is an old school parable of good and evil. When a stranger enters the isolated mountain town of Viscos with the devil literally by his side, the widow Berta knows (because her deceased husband, with whom she communicates daily, tells her) that a battle for the town's souls has begun. The stranger, a former arms dealer, calls himself Carlos and proposes a wager to the town: if someone turns up murdered within a week, he'll give the town enough gold to make everyone wealthy. Carlos ensures people believe him by choosing the town bartender, the orphan Chantal Prym, as his instrument: he shows her where the gold is, confides that his wife and children have been executed by kidnapper terrorists (remember: 1992), and that he is hoping his belief that people are basically evil will be vindicated. Chantal would like nothing better than to disappear with the gold herself and thus faces her own dilemmas. Add in corrupt townspeople (including a priest), sometimes biting social commentary and, distastefully, a very heavily stereotyped recurring town legend about an Arab named Ahab, and you've got quite a little Garden of Eden potboiler. But the unsatisfying ending lets everyone off the hook and leaves questions hanging like ripe apples.(July 3)Copyright &copy; Reed Business Information, a division of Reed Elsevier Inc. All rights reserved.--This text refers to theHardcoveredition."}, {"asin": "0007118899", "title": "Tatiana and Alexander", "description": "Praise for Tatiana and Alexander 'This has everything a romance glutton could wish for: a bold, talented and dashing hero, a heart-stopping love affair that nourishes its two protagonists even when they are separated and lost, a long and bitter military campaign, plus personal excavations into the past. It also has - thank goodness - a welcome sense of humour and discernable characters rather than ciphers.' Victoria Moore, Daily Mail The Bronze Horseman 'Pulling off the passionate love story embedded in a truly epic narrative is a difficult thing to do. Margaret Mitchell's Gone With the Wind remains the blueprint for the genre, while Tolstoy's War and Peace carries off the literary honours ... it's quickly apparent that the Russian-born author Paullina Simons has the measure of this kind of epic romantic saga. The power of her descriptive writing, the vividness of the historical detail and, most of all, the strength of her central characters mark out her novel as a considerable achievement ... she is able to make some powerful statements about the durability of the human spirit, but never at the expense of descriptive passages refulgent with power and beauty' Barry Forshaw, amazon"}, {"asin": "0007137508", "title": "Wellington: The Iron Duke", "description": "\"In Holmes' surprisingly revisionist view, Wellington emerges as far better soldier than he was a loveable individual.\" --The Times"}, {"asin": "0007136838", "title": "And Then There Were None (Agatha Christie Collection)", "description": "Considered the best mystery novel ever written by many readers,And Then There Were Noneis the story of 10 strangers, each lured to Indian Island by a mysterious host. Once his guests have arrived, the host accuses each person of murder. Unable to leave the island, the guests begin to share their darkest secrets--until they begin to die.--This text refers to an out of print or unavailable edition of this title."}, {"asin": "0007145160", "title": "Light on the Yoga Sutras of Patanjali", "description": "&#x201C;Patanjali's Yoga Sutras is the bible of yoga&#x2026;&#x201D;Godfrey Devereux&#x201C;BKS Iyengar is renowned throughout the world&#x2026; his inspired commentary on the ageless treatise by the ancient sage speaks to the soul of every dedicated yogi.\"Phil Catalfo, Yoga Journal"}, {"asin": "0007148976", "title": "The Witch of Blackbird Pond (Collins Modern Classics)", "description": "Forced to leave her sunny Caribbean home for the bleak Connecticut Colony, Kit Tyler is filled with trepidation. As they sail up the river to Kit's new home, the teasing and moodiness of a young sailor named Nat doesn't help. Still, her unsinkable spirit soon bobs back up. What this spirited teenager doesn't count on, however, is how her aunt and uncle's stern Puritan community will view her. In the colonies of 1687, a girl who swims, wears silk and satin gowns, and talks back to her elders is not only headstrong, she is in grave danger of being regarded as a witch. When Kit befriends an old Quaker woman known as the Witch of Blackbird Pond, it is more than the ascetics can take: soon Kit is defending her life. Who can she count on as she confronts these angry and suspicious townspeople?A thoroughly exciting and rewarding Newbery Medal winner and ALA Notable Children's Book, Elizabeth George Speare'sThe Witch of Blackbird Pondbrings this frightening period of witch hysteria to life. Readers will wonder at the power of the mob mentality, and the need for communities in desperate times--even current times--to find a scapegoat. (Ages 9 and older)--Emilie Coulter--This text refers to an out of print or unavailable edition of this title."}, {"asin": "0007149824", "title": "The Yiddish Policemen's Union", "description": "[Signature]Reviewed byJess WalterThey are the \"frozen Chosen,\" two million people living, dying and kvetching in Sitka, Alaska, the temporary homeland established for displaced World War II Jews in Chabon's ambitious and entertaining new novel. It is&mdash;deep breath now&mdash;a murder-mystery speculative-history Jewish-identity noir chess thriller, so perhaps it's no surprise that, in the back half of the book, the moving parts become unwieldy; Chabon is juggling narrative chainsaws here.The novel begins&mdash;the same way that Philip Roth launchedThe Plot Against America&mdash;with a fascinating historical footnote: what if, as Franklin Roosevelt proposed on the eve of World War II, a temporary Jewish settlement had been established on the Alaska panhandle? Roosevelt's plan went nowhere, but Chabon runs the idea into the present, back-loading his tale with a haunting history. Israel failed to get a foothold in the Middle East, and since the Sitka solution was only temporary, Alaskan Jews are about to lose their cold homeland. The book's timeless refrain: \"It's a strange time to be a Jew.\"Into this world arrives Chabon's Chandler-ready hero, Meyer Landsman, a drunken rogue cop who wakes in a flophouse to find that one of his neighbors has been murdered. With his half-Tlingit, half-Jewish partner and his sexy-tough boss, who happens also to be his ex-wife, Landsman investigates a fascinating underworld of Orthodox black-hat gangs and crime-lord rabbis. Chabon's \"Alyeska\" is an act of fearless imagination, more evidence of the soaring talent of his previous genre-blender, the Pulitzer Prize&ndash;winningThe Amazing Adventures of Kavalier and Clay.Eventually, however, Chabon's homage to noir feels heavy-handed, with too many scenes of snappy tough-guy banter and too much of the kind of elaborate thriller plotting that requires long explanations and offscreen conspiracies.Chabon can certainly write noir&mdash;or whatever else he wants; his recent Sherlock Holmes novel,The Final Solution, was lovely, even if theNew York Times Book Reviewsniffed its surprise that the mystery novel would \"appeal to the real writer.\" Should any other snobs mistake Chabon for anything less than a real writer, this book offers new evidence of his peerless storytelling and style. Characters have skin \"as pale as a page of commentary\" and rough voices \"like an onion rolling in a bucket.\" It's a solid performance that would have been even better with a little more Yiddish and a little less police.(May)Jess Walter was a finalist for the 2006 National Book Award forThe Zeroand the winner of the 2006 Edgar Award for best novel forCitizen Vince.Copyright &copy; Reed Business Information, a division of Reed Elsevier Inc. All rights reserved."}, {"asin": "0007147201", "title": "William Pitt the Younger: A Biography", "description": "Late-eighteenth-century politician William Pitt the Younger was the youngest (at 24) and longest-serving British prime minister. Beyond those facts, historical opinion varies--some scholars regard him as a reformer, and others as a reactionary, a debate that inspirits Michael Turner'sPittthe Younger (2003). Hague's biography differs from Turner's by muting interpretive issues and amplifying the day-to-day events in a life permeated by politics. Pitt's personal life remains enigmatic, and Hague acknowledges Pitt's elusiveness even as he attempts to ascertain whether he was an alcoholic or a homosexual. More certain is Pitt's ability as a leader and orator of the House of Commons, an institution the author himself knows well; he was the Conservative Party's former debating antagonist of Labour leader Tony Blair. Hague's experience adds convincing power to his account of Pitt's career, explaining how he remained ascendant for so long. A thorough biography, Hague's work is also an able contribution to British parliamentary history.Gilbert TaylorCopyright &#169; American Library Association. All rights reserved--This text refers to theHardcoveredition."}, {"asin": "0007149042", "title": "Abarat", "description": NaN}, {"asin": "0007161263", "title": "A Sense of the World: How a Blind Man Became History's Greatest Traveler", "description": "Starred Review.In this vibrant biography of James Holman (1786&ndash;1857), Roberts, a contributor to theVillage VoiceandMcSweeney's, narrates the life of a 19th-century British naval officer who was mysteriously blinded at 25, but nevertheless became the greatest traveler of his time. Holman entered the navy at age 12, at the height of the Napoleonic Wars. When blindness overcame him, Holman was an accomplished sailor, and he engineered to join the Naval Knights of Windsor, a quirky group who only had to live in quarters near Windsor Castle and attend mass for their stipend. For many blind people at the time, this would have been the start of a long (if safe) march to the grave. Holman would have none of it and spent the bulk of his life arranging leaves of absence from the Knights in order to wander the world (without assistance) from Paris to Canton; study medicine at the University of Edinburgh; hunt slavers off the coast of Africa; get arrested by one of the czar's elite bodyguards in Siberia; and publish several bestselling travel memoirs. Roberts does Holman justice, evoking with grace and wit the tale of this man once lionized as \"The Blind Traveler.\"(June)Copyright &copy; Reed Business Information, a division of Reed Elsevier Inc. All rights reserved.--This text refers to theHardcoveredition."}, {"asin": "0007158505", "title": "The Sneetches and Other Stories: Yellow Back Book (Dr Seuss - Yellow Back Book) (Dr. Seuss: Yellow Back Books)", "description": "\"Now, the Star-Belly Sneetches / Had bellies with stars. / The  Plain-Belly Sneetches / Had none upon thars.\" This collection of four of Dr. Seuss's most winning stories begins with that unforgettable tale of the unfortunate Sneetches, bamboozled by one Sylvester McMonkey McBean (\"the Fix-it-up Chappie\"), who teaches them that pointless prejudice can be costly. Following the Sneetches, a South-Going Zax and a North-Going Zax seem determined to butt heads on the prairie of Prax. Then there's the tongue-twisting story of Mrs. McCave--you know, the one who had 23 sons and named them all Dave. (She realizes that she'd be far less confused had she given them different names, like Marvin O'Gravel Balloon Face or Zanzibar Buck-Buck McFate.) A slightly spooky adventure involving a pair of haunted trousers--\"What was I scared of?\"--closes out the collection.Sneetches and Other Storiesis Seuss at his best, with distinctively wacky illustrations and ingeniously weird prose. (Ages 4 to 8)--Paul Hughes--This text refers to theLibrary Bindingedition."}, {"asin": "0007157169", "title": "Perelandra (Cosmic Trilogy)", "description": "'Thrilling.' Sir Hugh Walpole 'Remarkable ... a rare power of inventive imagination.' Times Literary Supplement"}, {"asin": "0007157177", "title": "That Hideous Strength", "description": "'An extravagant mingling of dream and realism... excellent and thrilling reading' Daily Telegraph"}, {"asin": "0007169914", "title": "Mr. Brown Can Moo! Can You?: Blue Back Book (Dr Seuss - Blue Back Book) (Dr. Seuss Blue Back Books)", "description": "Oh, the wonderful things Mr. Brown can do! In this \"Book of Wonderful Noises,\" Mr. Brown struts his stuff, as he imitates everything from popping corks to horse feet (\"pop pop pop pop\" and \"klopp klopp klopp,\" respectively) while inviting everyone to join him in the fun. Young readers who are still learning their sounds and letters will get a wacky workout as they follow along with the very serious-looking, squinty-eyed Mr. Brown. Whether it's eggs frying in a pan or a hippo chewing gum, the skillful Mr. Brown just keeps topping himself, with a \"sizzle sizzle\" or a \"grum grum grum.\" \"Mr. Brown is so smart he can even do this: he can even make a noise like a goldfish kiss!... pip!\" As usual, the words and pictures of Dr. Seuss make reading (and making all sorts of funny noises) impossible to resist.Mr. Brown Can Moo! Can You?will stay fresh through many a giggling reading.--Paul Hughes--This text refers to theHardcoveredition."}, {"asin": "0007167040", "title": "Seabiscuit: The True Story of Three Men and a Racehorse", "description": "He didn'tlooklike much. With his smallish stature, knobby  knees, and slightly crooked forelegs, he looked more like a cow pony than a  thoroughbred. But looks aren't everything; his quality, an admirer once wrote,  \"was mostly in his heart.\" Laura Hillenbrand tells the story of the horse who  became a cultural icon inSeabiscuit: An American Legend.Seabiscuit rose to prominence with the help of an unlikely triumvirate: owner  Charles Howard, an automobile baron who once declared that \"the day of the horse  is past\"; trainer Tom Smith, a man who \"had cultivated an almost mystical  communication with horses\"; and jockey Red Pollard, who was down on his luck  when he charmed a then-surly horse with his calm demeanor and a sugar cube.  Hillenbrand details the ups and downs of \"team Seabiscuit,\" from early training  sessions to record-breaking victories, and from serious injury to \"Horse of the  Year\"--as well as the Biscuit's fabled rivalry with War Admiral. She also  describes the world of horseracing in the 1930s, from the snobbery of Eastern  journalists regarding Western horses and public fascination with the great  thoroughbreds to the jockeys' torturous weight-loss regimens, including saunas  in rubber suits, strong purgatives, even tapeworms.Along the way, Hillenbrand paints wonderful images: tears in Tom Smith's eyes as  his hero, legendary trainer James Fitzsimmons, asked to hold Seabiscuit's bridle  while the horse was saddled; critically injured Red Pollard, whose  chest was crushed in a racing accident a few weeks before, listening to the San  Antonio Handicap from his hospital bed, cheering \"Get going, Biscuit! Get 'em,  you old devil!\"; Seabiscuit happily posing for photographers for several minutes  on end; other horses refusing to work out with Seabiscuit because he teased and  taunted them with his blistering speed.Though sometimes her prose takes on a distinctly purple hue (\"His history had  the ethereal quality of hoofprints in windblown snow\"; \"The California sunlight  had the pewter cast of a declining season\"), Hillenbrand has crafted a  delightful book. Wire to wire,Seabiscuitis a winner. Highly  recommended.--Sunny Delaney--This text refers to an out of print or unavailable edition of this title."}, {"asin": "0007157150", "title": "Out of the Silent Planet (Cosmic Trilogy)", "description": "'Adventure beyond our Earth - beautifully coloured and shaped.' The Times 'This book has real splendour, compelling moments and a flowing narrative.' New York Times"}, {"asin": "0007182155", "title": "Solo", "description": NaN}, {"asin": "0007194161", "title": "The Contortionist's Handbook", "description": "Clevenger's debut novel is a well-crafted but underplotted character study of a brilliant, damaged man who struggles with mental illness and substance abuse as he bounces in and out of prison and a series of hospitals around Los Angeles. Most of the novel takes place in the latter setting; some tense early scenes pit protagonist John Dolan Vincent against a psychiatrist known as \"The Evaluator,\" who probes Vincent's psyche to see if his recent overdose of muscle relaxants was really a botched attempt to cure his migraine, as Vincent claims, or a suicide attempt. The twist is that Vincent has checked into the hospital under an assumed name; after each of his previous overdoses he has changed his identity to avoid being placed in a mental hospital. The psychiatric interview provides a decent vehicle for telling the story of Vincent's difficult family life and his decision to use his mathematical talent to assist a murky criminal network. The trouble is that Clevenger has little to offer to push his story forward besides Vincent's efforts to protect Keadra, the woman he falls in love with during a hospital stint, from the thugs who are trying to track him down. Clevenger is a solid writer who does some good work when it comes to creating a noirish atmosphere and smart, compelling characters, but the pace is uneven at best. The quality of the writing warrants a follow-up effort; hopefully, Clevenger will know what to do with his characters the next time around.Copyright 2002 Reed Business Information, Inc.--This text refers to an out of print or unavailable edition of this title."}, {"asin": "0007189885", "title": "Purple Hibiscus (P.S.)", "description": "Purple Hibiscus, Nigerian-born writer Chimamanda Ngozi Adichie's debut, begins like many novels set in regions considered exotic by the western reader: the politics, climate, social customs, and, above all, food of Nigeria (balls of fufu rolled between the fingers, okpa bought from roadside vendors) unfold like the purple hibiscus of the title, rare and fascinating. But within a few pages, these details, however vividly rendered, melt into the background of a larger, more compelling story of a joyless family. Fifteen-year-old Kambili is the dutiful and self-effacing daughter of a rich man, a religious fanatic and domestic tyrant whose public image is of a politically courageous newspaper publisher and philanthropist. No one in Papa's ancestral village, where he is titled \"Omelora\" (One Who Does For the Community), knows why Kambili&#xB9;s brother cannot move one of his fingers, nor why her mother keeps losing her pregnancies. When a widowed aunt takes an interest in Kambili, her family begins to unravel and re-form itself in unpredictable ways.--Regina Marler--This text refers to an out of print or unavailable edition of this title."}, {"asin": "0007192932", "title": "The Element Encyclopedia of Witchcraft: The Complete A-Z for the Entire Magical World", "description": "Illes, the author of three previous books on magical spells, has compiled a lively and chatty reference on witches. The work is arranged topically, and there is a helpful index. Individual articles within the topic chapters sometimes haveseereferences as well. After a long introduction discussing several different and sometimes nearly mutually exclusive definitions of witches, chapters cover plants, animals, food and drink, magical beings, famous people in the magical world, the creative arts, witch persecution, and more. Chapters--or sections within the chapters--includeA-Zentries that range from a few paragraphs to a few pages. An extensive bibliography and a list of Internet resources complete the work.Illes focuses most strongly on Western European witchcraft practice and history, but she gives considerable attention to Asian, African, Mesoamerican, Caribbean, and South American practice as well. The creative arts chapter is up-to-date enough to discuss the Harry Potter phenomenon as well as many films, television programs, and other arts-related representations. Illes' take on the representation of witches inThe Wizard of Ozis in solidarity with witch practice.The book is long and could have used editing both to trim the text and to correct errors in spelling and grammar. Illes tends to overwrite when she feels passionately, and an editor would have helped with this as well. The horrors of witch persecutions--which continue in many places to this day--do not require overwriting, as William Burns shows very well inWitch Hunts in Europe and America(Greenwood, 2003), which is not in the bibliography.Academic libraries with extensive witchcraft collections may wish to consider this volume if only for the bibliography. Public libraries seeking a popular reference work on witchcraft could do much worse than this one. At the price, public libraries may wish to purchase some circulating copies as well.Kathleen StipekCopyright &#169; American Library Association. All rights reserved"}, {"asin": "000720311X", "title": "Frankenstein. Book 3: dead and alive", "description": NaN}, {"asin": "0007228023", "title": "Teacher Man", "description": NaN}, {"asin": "0007230206", "title": "Wolf Hall", "description": "Amazon Best of the Month, October 2009:No character in the canon has been writ larger than Henry VIII, but that didn't stop Hilary Mantel. She strides through centuries, past acres of novels, histories, biographies, and plays--even past Henry himself--confident in the knowledge that to recast history's most mercurial sovereign, it's not the King she needs to see, but one of the King's most mysterious agents. Enter Thomas Cromwell, a self-made man and remarkable polymath who ascends to the King's right hand. Rigorously pragmatic and forward-thinking, Cromwell has little interest in what motivates his Majesty, and although he makes way for Henry's marriage to the infamous Anne Boleyn, it's the future of a free England that he honors above all else and hopes to secure. Mantel plots with a sleight of hand, making full use of her masterful grasp on the facts without weighing down her prose. The opening cast of characters and family trees may give initial pause to some readers, but persevere: the witty, whip-smart lines volleying the action forward may convince you a short stay in the Tower of London might not be so bad... provided you could bring a copy ofWolf Hallalong. --Anne Bartholomew--This text refers to an out of print or unavailable edition of this title."}, {"asin": "0007236360", "title": "Damaged: The Heartbreaking True Story of a Forgotten Child", "description": "'Cannot fail to move those who read it.' Adoption-net&#x2018;Heartbreaking.' The Mirror'A true tale of hope. ****.' OK!&#x2018;Foster carers rarely get the praise they deserve, but Cathy Glass&#x2019;s book should change all that.****&#x2019; First Magazine"}, {"asin": "0007245823", "title": "A VINTAGE AFFAIR", "description": NaN}, {"asin": "0007256817", "title": "Punished: A mother's cruelty. A daughter's survival. A secret that couldn't be told.", "description": "Vanessa Steel was born and brought up on the outskirts of Birmingham in the 1950s. After surviving her ordeals, and developing her psychic gift (as a young child she foresaw the assassination of Kennedy in 1963 without knowing who he was), she starting working professionally as a psychic. She is now one of the most sought after psychics in Britain."}, {"asin": "000725394X", "title": "Preacher (Patrik Hedstrom 2)", "description": NaN}, {"asin": "0007263686", "title": "Finest Years: Churchill as Warlord 1940-45", "description": NaN}, {"asin": "000727405X", "title": "Cry Silent Tears: The heartbreaking survival story of a small mute boy who overcame unbearable suffering and found his voice again", "description": "Now thirty four years old, Joe Peters survived a horrific childhood to bring up five children of his own, some of whom had special needs. He has set up a service on the internet to help children like himself to find assistance and is a spokesman on behalf of all abused children, particularly those who fall into the hands of the organised criminals who create internet pornography."}, {"asin": "0007281447", "title": "Open An Autobiography", "description": NaN}, {"asin": "0007269854", "title": "The Ice Princess", "description": "Starred Review. At the start of L&auml;ckberg's haunting U.S. debut, the first of her seven novels set in the Swedish coastal town of Fj&auml;llbacka, biographer Erica Falck returns home to sort through her deceased parents' belongings and work on her next book. But this is not the same hometown she grew up in. Summer tourists are turning the former fishing village into a thriving resort, and Erica's controlling brother-in-law is pressuring her to cash in by selling the family home. The apparent suicide of childhood friend Alexandra Wijkner contributes to Erica's grief. Once inseparable, they drifted apart before Alex's family abruptly moved away, and Erica feels compelled to write a novel about why the beautiful Alex would kill herself. L&auml;ckberg skillfully details how horrific secrets are never completely buried and how silence can kill the soul. A parallel between the town's downward spiral and the fate of one of Fj&auml;llbacka's wealthiest families adds texture.(June)Copyright &copy; Reed Business Information, a division of Reed Elsevier Inc. All rights reserved.--This text refers to an alternateHardcoveredition."}, {"asin": "0007303017", "title": "Endal: How One Extraordinary Dog Brought a Family Back from the Brink", "description": "'Endal is a true dog hero: kind, intelligent, incredibly resourceful, very funny and utterly devoted to his master Allen Parton [!] this is one of the great uplifting dog stories.' Jilly Cooper"}, {"asin": "0007281048", "title": "The Saddest Girl in the World", "description": "Cathy has been a foster carer for over 20 years, during which time she has looked after more than 70 children, of all ages and backgrounds. Cathy runs training courses on fostering for her local Social Services, and helps draft new fostering procedures and guidelines. She has three teenage children of her own; one of whom was adopted after a long-term foster placement. The name Cathy Glass is a pseudonym."}, {"asin": "0007333994", "title": "Sixty-One Nails", "description": "\"Sixty-One Nails is Neverwhere for the next generation. The pacing is spot-on, the characters engaging, and the world fits together beautifully to create a London that ought to be. I stayed up too late finishing it.\" - C.E. Murphy  \"If you've been thinking urban fantasy has nothing fresh to offer, think again.\" - Juliet E. McKenna  \"This book is magnificent in every way. Sixty One Nails is a novel I will remember for a very long time. 5*****\" - ScienceFictionandFantasy.co.uk  \"I would recommend this book to anyone who wishes for something different in the urban fantasy genre.\" - Fantasy Book Critic"}, {"asin": "0007386648", "title": "Unbroken", "description": NaN}, {"asin": "0007373619", "title": "House on Willow Street", "description": "Kelly&#x2019;s latest novel features four women&#x2014;all beautiful, all wounded in one way or another, and all facing life crises at the same time. Sisters Suki and Tess hail from an Irish town where the postmistress, Danae (a woman of mystery to curious townsfolk), is joined by her heartbroken niece, Mara&#x2014;romances ensue. Stories with four main characters are bound to be complex, and this one is no exception, but plots and subplots are well handled. Secondary characters are quirky and add to the reading fun. The omniscient narration covers 20 years in the lives of the women through flashbacks, artfully placed to shed a little light on present-day happenings and just enough information to ensure a suspenseful read. Kelly&#x2019;s readers will take comfort in her recognition of the humor in daily life, the necessity of friendship to women, and the strength of bonds among families. This modern-day fairy tale, which starts out sad and ends up just fine, will please Kelly&#x2019;s fans and appeal to more mature readers of chick lit. --Ellen Loughran--This text refers to thePaperbackedition."}, {"asin": "0007423632", "title": "Prince of Thorns (The Broken Empire)", "description": "'Dark and relentless, Prince of Thorns will pull you under and drown you in story. A two in the morning page turner. Jaw-dropping' Robin Hobb 'This is a lean, cold knife-thrust of a novel, a revenge fantasy anchored on the compelling voice and savage purpose of its titular Prince. There is never a safe moment in Lawrence's debut' Robert Redick, author of The Red-Wolf Conspiracy 'Prince of Thorns got hold of me from page one and didn't let go until I finished it on my second reading session on the second day. There's humour here, gut-wrenching realism, high adventure, something that might be magic in the story, and certainly is in the telling of it. It was almost as if the shade of David Gemmell had returned, somewhat nastier for the experience. Thoroughly recommended. Thanks Mr Lawrence' Neal Asher 'Prince of Thorns is one of this year's most anticipated fantasy debuts; and now I know why! It's incredible' civilian-reader.blogspot.com"}, {"asin": "0007420765", "title": "The Stonecutter", "description": NaN}, {"asin": "0007441290", "title": "The Marriage Plot", "description": "Amazon Best Books of the Month, October 2011:Even among authors,Jeffrey Eugenidespossesses a rare talent for being able to inhabit his characters. InThe Marriage Plot, his third novel and first in ten years (following the Pulitzer Prize-winningMiddlesex), Eugenides describes a year or so in the lives of three college seniors at Brown in the early 80s. There is Madeleine, a self-described &#x201C;incurable romantic&#x201D; who is slightly embarrassed at being so normal. There is Leonard, a brilliant, temperamental student from the Pacific Northwest. And completing the triangle is Mitchell, a Religious Studies major from Eugenides&#x2019; own Detroit. What follows is a book delivered in sincere and genuine prose, tracing the end of the students&#x2019; college days and continuing into those first, tentative steps toward true adulthood. This is a thoughtful and at times disarming novel about life, love, and discovery, set during a time when so much of life seems filled with deep portent.--Chris Schluep--This text refers to an out of print or unavailable edition of this title."}, {"asin": "0007436564", "title": "The Boy No One Loved", "description": "Casey Watson is a specialist foster carer. She has been working in this field for six years after giving up her position as a behaviour manager for a local school. During this time she has welcomed 14 difficult to place children into her home.As a specialist foster carer she works with profoundly damaged children, seeing each child through a specific behavioural modification programme, at the end of which they will hopefully be in the position to be returned either back to their family or into mainstream foster care.Casey combines fostering with writing, usually late at night when the rest of the family is sleeping. Casey is married with two grown-up children and three grandchildren. The name Casey Watson is a pseudonym.This is Casey&#x2019;s first book. Her next title is called Crying for Help."}, {"asin": "0007447868", "title": "A Feast for Crows (A Song of Ice and Fire)", "description": "Long-awaited doesn't begin to describe this fourth installment in bestseller Martin's staggeringly epic Song of Ice and Fire. Speculation has run rampant since the previous entry,A Storm of Swords, appeared in 2000, andFeastteases at the important questions but offers few solid answers. As the book begins, Brienne of Tarth is looking for Lady Catelyn's daughters, Queen Cersei is losing her mind and Arya Stark is training with the Faceless Men of Braavos; all three wind up in cliffhangers that would do justice to any soap opera. Meanwhile, other familiar faces&mdash;notably Jon Snow, Tyrion Lannister and Daenerys Targaryen&mdash;are glaringly absent though promised to return in book five. Martin's Web site explains thatFeastand the forthcomingA Dance of Dragonswere written as one book and split after they grew too big for one volume, and it shows. This is not Act I Scene 4 but Act II Scene 1, laying groundwork more than advancing the plot, and it sorely misses its other half. The slim pickings here are tasty, but in no way satisfying.(Nov.)Copyright &copy; Reed Business Information, a division of Reed Elsevier Inc. All rights reserved.--This text refers to theHardcoveredition."}, {"asin": "0007442920", "title": "Insurgent (Divergent)", "description": "Praise for DIVERGENT: \"The next big thing.\" (Rolling Stone ) \"If you like Hunger Games & Twilight, then get stoked for DIVERGENT! Trust us on this-this baby is going to blow up BIG! And if you chose to remain factionless, then you're gonna be one lonely soul.\" (PerezHilton.com ) \"A taut and shiveringly exciting read! Tris is exactly the sort of unflinching and fierce heroine I love. I couldn't turn the pages fast enough.\" Melissa Marr, bestselling author of Wicked Lovely \"DIVERGENT is a captivating, fascinating book that kept me in constant suspense and was never short on surprises. It will be a long time before I quit thinking about this haunting vision of the future.\" James Dashner, author of 'The Maze Runner' \"Well-written and brilliantly executed, DIVERGENT is a heart-pounding debut that cannot be missed. Tris stands out in her action-packed, thrilling, and emotionally honest journey to determine who she wants to be in a society that demands she conform. It's dystopian fiction at its best!\" Kiersten White, New York Times bestselling author of PARANORMALCY \"A memorable, unpredictable journey from which it is nearly impossible to turn away\" - Publishers Weekly \"Divergent holds its own in the [dystopian] genre, with brisk pacing, lavish flights of imagination and writing that occasionally startles with fine detail.\" - New York Times \" A masterpiece of epic proportions and an outstanding debut novel.\" - Narratively Speaking Blog \"Be prepared to sit on the edge of your seats as this heart-pounding thriller hypnotises you until the very last page.\" - Fantasticbookreviews.com"}, {"asin": "0007444117", "title": "Allegiant (Divergent, #3)", "description": NaN}, {"asin": "0007410956", "title": "Lost in Shangri-La: Escape from a Hidden World", "description": "Amazon Best Books of the Month, May 2011:  Near the end of World War II, a plane carrying 24 members of the United States military, including nine Women&#x2019;s Army Corps (WAC) members, crashed into the New Guinea jungle during a sightseeing excursion. 21 men and women were killed. The three survivors--a beautiful WAC, a young lieutenant who lost his twin brother in the crash, and a severely injured sergeant--were stranded deep in a jungle valley notorious for its cannibalistic tribes. They had no food, little water, and no way to contact their military base. The story of their survival and the stunning efforts undertaken to save them are the crux ofLost in Shangri-La, Mitchell Zuckoff&#x2019;s remarkable and inspiring narrative. Faced with the potential brutality of the Dani tribe, known throughout the valley for its violence, the trio&#x2019;s lives were dependent on an unprecedented rescue mission--a dedicated group of paratroopers jumped into the jungle to provide aid and medical care, consequently leaving the survivors and paratroopers alike trapped on the jungle floor. A perilous rescue by plane became their only possible route to freedom. A riveting story of deliverance under the most unlikely circumstances,Lost in Shangri-Ladeserves its place among the great survival stories of World War II.--Lynette MongAmazon Exclusive: Hampton Sides ReviewsLost in Shangri-LaHampton Sidesis the editor-at-large forOutsidemagazine and the author of the international bestsellerGhost Soldiers, which won the 2002 PEN USA Award for nonfiction and the 2002 Discover Award from Barnes &amp; Noble, and also served as the basis for the 2005 Miramax filmThe Great Raid.Although World War II was the greatest conflict in the history of this planet, many a jaded reader has come to the reluctant conclusion that there aren&rsquo;t any more World War II stories left to tell. At least not good ones&mdash;not tales of the &ldquo;ripping good yarn&rdquo; variety. Yet remarkably, in his new bookLost in Shangri-La, Mitchell Zuckoff has found one, and he&rsquo;s told it with reportorial verve, narrative skill, and exquisite pacing.What makes this World War II story all the more fascinating is that it isn&rsquo;t really a war story&mdash;not in a strict military sense. It&rsquo;s more of an exotic adventure tale with rich anthropological shadings. In 1945, near the end of the war, an American plane crashes in a hidden jungle valley in New Guinea inhabited by Stone Age cannibals. 21 Americans die in the crash, but three injured survivors soon find themselves stumbling through the jungle without food, nursing terrible wounds and trying to elude Japanese snipers known to be holding out in the mountains.The first contact between the three Americans and the valley&rsquo;s Dani tribesmen is both poignant and comical. The Americans, Zuckoff writes, have &ldquo;crash-landed in a world that time didn&rsquo;t forget. Time never knew it existed.&rdquo; The tribesmen, who have never encountered metal and have yet to master the concept of the wheel, think the American interlopers are white spirits who&rsquo;ve descended on a vine from heaven, fulfilling an ancient legend. They&rsquo;re puzzled and fascinated by the layers of &ldquo;removable skin&rdquo; in which these alien visitors are wrapped; the natives, who smear their bodies in pig grease and cover their genitals with gourds, have never seen clothes before.The Americans, in turn, are pretty sure their boartusk-bestudded hosts want to skewer them for dinner.What ensues in Zuckoff&rsquo;s fine telling is not so much a cultural collision as a pleasing and sometimes hilarious mutual unraveling of assumptions. Though the differences in the two societies are chasmic, the Americans and the Dani become&mdash;in a guarded, tentative sort of way&mdash;friends.But when armed American airmen arrive via parachute to rescue the survivors, relations become more tense. The Americans make their camp right in the middle of a no-man&rsquo;s land between warring Dani tribes&mdash;a no-man&rsquo;s land where for centuries they have fought the battles that are central to their daily culture. Here, Zuckoff notes, the ironies are profoundly rich. The Dani, untouched by and indeed utterly unaware of the great war that&rsquo;s been raging all across the globe, become thoroughly discombobulated when their own war is temporarily disrupted.Yes, therearestill a few good World War II stories left to tell. And yes, this one meets all the requirements of a ripping good yarn. Zuckoff, who teaches journalism at Boston University, is a first-rate reporter who has spared no expense to rescue this tale from obscurity. His story has it all: Tragedy, survival, comedy, an incredibly dangerous eleventh-hour rescue, and an immensely attractive heroine to boot. It&rsquo;s extraordinary that Hollywood hasn&rsquo;t already taken this tale and run wild with it. If it did, the resulting movie would be equal partsAlive,Cast Away, andThe Gods Must Be Crazy. It&rsquo;s as though the Americans have arrived in the Stone Age through a wormhole in the space-time continuum. The Dani don&rsquo;t know what to do with themselves&mdash;and life, as any of us know it, will never be the same.--This text refers to theHardcoveredition."}, {"asin": "0007442629", "title": "The Night the Angels Came", "description": "REVIEWS FOR GIRL IN THE MIRROR&#x2018;A moving read that Cathy Glass fans will devour.&#x2019; The SunREVIEWS FOR DAMAGED&#x2018;Cannot fail to move those who read it.&#x2019; Adoption-net&#x2018;Heartbreaking.&#x2019; The Mirror&#x2018;A truly harrowing read that made me cry.&#x2019; The Sun&#x2018;A true tale of hope.****.&#x2019; OK!Foster carers rarely get the praise they deserve, but Cathy Glass&#x2019;s book should change all that.****&#x2019; First magazine&#x2018;A hugely touching and emotional true tale.&#x2019; Star magazine"}, {"asin": "0007488238", "title": "Cupcakes at Carrington's", "description": "&#x2018;Defies the chick lit clich&#xE9;.&#x2019; &#x2013; Heat magazine'Cupcakes at Carrington's is deliciously delightful from start to finish, sprinkled with magic and full of heart.' Miranda Dickinson&#x2018;I loved it. 5/5&#x2019; &#x2013; iheart-chicklit.blogspot.co.uk&#x2018;So much more than just a chick lit novel. It has the humour of Sophie Kinsella, the warmth of Cecelia Ahern and the wit and wisdom of Maeve Binchy and the cheek of Are You Being Served?&#x2019; &#x2013; Jamieson Villeneuve, Thebookpedler.wordpress.com&#x2018;My favourite book this year &#x2013; funny, romantic and fabulous!&#x2019; &#x2013; readinginthesunshine.wordpress.com&#x2018;I loved Cupcakes At Carrington&#x2019;s, a warm, witty, loveable read with plenty of sparkle and charm.&#x2019; &#x2013; Rowan Coleman"}, {"asin": "0007466064", "title": "Dance with Dragons: Dreams and Dust (A Song of Ice and Fire)", "description": "'In the grand epic fantasy tradition, Martin is by far the best' Time Magazine 'Richly satisfying and utterly engrossing' Sunday Times 'The sheer mind-boggling scope of this epic has sent other fantasy writers away shaking their heads ...Its ambition: to construct the Twelve Caesars of fantasy fiction, with characters so venomous they could eat the Borgias' Guardian 'Colossal, staggering ... Martin captures all the intoxicating complexity of the Wars of the Roses or Imperial Rome' SFX"}, {"asin": "0007456816", "title": "Tales of the Gypsy Dressmaker", "description": "Thelma built her dressmaking business from the ground up. After being left with nothing after a divorce she started making and selling dresses on a market stall in Liverpool.           One day a traveller woman asked her to make some dresses and before she knew it she had dozens of traveller women asking for the same thing, and so began her dressmaking business.           Thelma now owns Nico's Dressmakers in Liverpool and is the designer favoured by travellers around the country, many of whom travel hundreds of miles to have her make their wedding, christening and communion dresses.           Thelma lives in Liverpool and has four children (a son and three daughters), the youngest of which still lives at home with her and her partner Dave."}, {"asin": "0007493754", "title": "The Third Kingdom", "description": NaN}, {"asin": "0007504586", "title": "Where the Devil Cant Go", "description": NaN}, {"asin": "0007479573", "title": "Your Personal Horoscope 2014: Month-by-month forecasts for every sign", "description": "Joseph Polansky is a leading US astrologer who has been practising astrology for 20 years."}, {"asin": "0007506236", "title": "Churchill's Angels", "description": "Amazing five star reviews from Amazon:Petra \"book addict!!!\"Churchill's Angels by Ruby Jackson for me was a wonderful read and therefore would recommend this marvellous book to anyone who loves a not only a good read but one which will keep your attention until you reach the last page.M. E. NewellChurchill's Angels by Ruby Jackson is a great book! Ms. Jackson gives the reader great characters and an excellent story line. Any fan of wartime books will truly enjoy this book!S Knight \"Bookworm\"I loved this book &#x2013; cannot wait for the next one in the series. I really felt that I was there living with the characters. The historical detail is brilliant.J. Harper \"Jenny Harper\"Love, new challenges, death and humour battle on every page, ensuring that our attention is held from beginning to end. Can't wait for the next in the series!"}, {"asin": "0007491433", "title": "The Shock of the Fall", "description": NaN}, {"asin": "0007550197", "title": "Hidden", "description": NaN}, {"asin": "000766141X", "title": "Hop on Pop Classics HB", "description": "Poor, long-suffering Dad deserves a little lift every once in a while,  and who better to boost than Dr. Seuss? In this funky pop-up adaptation of the  classicHop on Pop, kids  do their best to perk up Pop after a bad day. The furry yellow Seuss-critters  know \"it's best not to HOP on POP,\" but \"we like to hop. / We like to hop / on  top of Pop. / STOP!\" Other, more human-looking children give their fathers  gifts, such as \"a set of Slim Jim Swim Fins\" (pink, three-toed marvels), violin  serenades, and for the man who has everything... \"a Bright Dwight Bird-Flight  Night-Sight Light.\" Clever paper engineering livens up this six-spread volume  (not that anything by Dr. Seuss ever needed enlivening). Young readers will love  making the gleeful characters hop on pop over and over, and will laugh to see  the walrus (another less-than-welcome gift) licking one poor daddy's ear. It's  hard to say who will enjoy this more: fathers or their well-meaning little  urchins. (Ages 3 to 7)--Emilie Coulter--This text refers to theBoard bookedition."}, {"asin": "0007491263", "title": "The Iron King (The Accursed Kings, Book 1)", "description": "*Starred Review* Sporting an enthusiastic introduction by George R. R. Martin (in which he calls the book &#x201C;the original game of thrones&#x201D;), this is the first U.S. publication of the first volume of French novelist Druon&#x2019;s seven-volume historical saga, collectively known as The Accursed Kings. Originally published in 1955, the novel is set in the year 1314. Philip IV, the king of France, has disbanded the Knights Templar, arresting, torturing, and executing most of them. Relations between France and England are as strained as they have ever been. Philip&#x2019;s increasingly desperate search for money to pay his massive debts has virtually bankrupted the country. Against this sprawling backdrop, Druon tells the story of Robert of Artois, a French lord whose lands have been taken from him by his greedy aunt and whose efforts to reclaim his birthright will lead to all-out war between France and England. Unlike Martin&#x2019;s multivolume Song of Fire and Ice, Druon&#x2019;s saga is based on real history and features real people as its central characters. It&#x2019;s historical fiction on a grand scale, full of political intrigue, family drama, and characters who, while drawn from life, are larger than it. Fans of historical epics who have not yet discovered Druon&#x2019;s saga will be thrilled with this one. --David Pitt"}, {"asin": "0020291922", "title": "Survival in Auschwitz", "description": "Survival in Auschwitzis a mostly straightforward narrative, beginning with Primo Levi's deportation from Turin, Italy, to the concentration camp Auschwitz in Poland in 1943. Levi, then a 25-year-old chemist, spent 10 months in the camp. Even Levi's most graphic descriptions of the horrors he witnessed and endured there are marked by a restraint and wit that not only gives readers access to his experience, but confronts them with it in stark ethical and emotional terms: &quot;[A]t dawn the barbed wire was full of children's washing hung out in the wind to dry. Nor did they forget the diapers, the toys, the cushions and the hundred other small things which mothers remember and which children always need. Would you not do the same? If you and your child were going to be killed tomorrow, would you not give him something to eat today?&quot;--Michael Joseph Gross--This text refers to an out of print or unavailable edition of this title."}, {"asin": "0020315910", "title": "EYE IN THE SKY (Collier Nucleus Science Fiction Classic)", "description": "\"Dick was many authors: a poor man's Pynchon, an oracular postmodern, a rich product of the changing counterculture.\""}, {"asin": "0020427859", "title": "Over Sea, Under Stone", "description": "Gr 5-7-The charming beginning to Susan Cooper's series of five books, which comprise The Dark Is Rising, belie a series of sinister adventures. The Drew children Simon, Jane, and Barney find an old map in a hidden room while summering at the Grey House in Cornwall. Along with their Great-Uncle Merry, they become embroiled in a web of intrigue that surrounds an Arthurian legend. True to the original story (Harcourt, 1965), this audio version adds a dynamic vocal element from narrator, Alex Jennings. In the beginning the story seems a bit slow and tedious as the plot and setting are given their due, and the voices may be difficult to distinguish. After the first side of tape 1, they become more well defined. Jennings gives each child a distinct voice, yet keeps each connected to one another. Barney has the youthful vulnerability of the youngest sibling, Jane, the sensible and soft-spoken middle child, and Simon speaks with the assurance and bravado of the \"older\" brother. The rising tension created between the fight of good and evil gives strength and vitality to each character's voice. Listeners understand Mr. Hasting's loathing and fear of Great-Uncle Merry when hearing the deep tone and resonance of every utterance. Jennings' ability is outstanding as he slips in and out of the numerous voices with the rapid dialogue as it approaches the climax. His training and experience as a member of the Royal Shakespeare Company and the Royal National Theatre give this story a vitality. This is an outstanding reading of a classic tale that all young listeners and adults will thoroughly enjoy.Tina Hudak, St. Bernard's School, Riverdale, MDCopyright 2001 Cahners Business Information, Inc.--This text refers to an out of print or unavailable edition of this title."}, {"asin": "002044995X", "title": "Blowback: The First Full Account of America's Recruitment of Nazis and Its Disastrous Effect on The cold war, Our Domestic and Foreign Policy.", "description": "The postwar recruitment of Nazis and collaborators by agencies of the U.S. government stemmed, the author illustrates, from intense East-West competition after the German surrender, prodded by the prospect of war between the superpowers. Simpson, a freelance journalist, reveals that many covert operations of the early Cold War era involved the use of operatives known to have committed crimes against humanity during the Second World War. The underlying theme here is the corruption of American ideals in connection with this hushed-up recruitment policy in the name of anticommunism. In elaborating the policy's \"negative blowback,\" Simpson emphasizes the long-term corrosive effect on American intelligence agencies in particular.Copyright 1988 Reed Business Information, Inc.--This text refers to an out of print or unavailable edition of this title."}, {"asin": "0020519001", "title": "A Farewell to Arms (A Scribner Classic)", "description": "As a youth of 18, Ernest Hemingway was eager to fight in the Great War. Poor vision kept him out of the army, so he joined the ambulance corps instead and was sent to France. Then he transferred to Italy where he became the first American wounded in that country during World War I. Hemingway came out of the European battlefields with a medal for valor and a wealth of experience that he would, 10 years later, spin into literary gold withA Farewell to Arms. This is the story of Lieutenant Henry, an American, and Catherine Barkley, a British nurse. The two meet in Italy, and almost immediately Hemingway sets up the central tension of the novel: the tenuous nature of love in a time of war. During their first encounter, Catherine tells Henry about her fianc&eacute; of eight years who had been killed the year before in the Somme. Explaining why she hadn't married him, she says she was afraid marriage would be bad for him, then admits:I wanted to do something for him. You see, I didn't care about the other thing and he could have had it all. He could have had anything he wanted if I would have known. I would have married him or anything. I know all about it now. But then he wanted to go to war and I didn't know.The two begin an affair, with Henry quite convinced that he \"did not love Catherine Barkley nor had any idea of loving her. This was a game, like bridge, in which you said things instead of playing cards.\" Soon enough, however, the game turns serious for both of them and ultimately Henry ends up deserting to be with Catherine.Hemingway was not known for either unbridled optimism or happy endings, andA Farewell to Arms, like his other novels (For Whom the Bell Tolls,The Sun Also Rises, andTo Have and Have Not), offers neither. What itdoesprovide is an unblinking portrayal of men and women behaving with grace under pressure, both physical and psychological, and somehow finding the courage to go on in the face of certain loss.--Alix Wilber--This text refers to an out of print or unavailable edition of this title."}, {"asin": "0025225804", "title": "Cassell's Standard Latin Dictionary, Thumb-indexed", "description": "Text: English, Latin--This text refers to an out of print or unavailable edition of this title."}, {"asin": "0025429655", "title": "1,000 Vegetarian Recipes", "description": "1,000 Vegetarian Recipes Have you been searching for a collection of delicious vegetarian recipes? What about easy-to-prepare vegetarian recipes, or those that are healthful? Then 1,000 Vegetarian Recipes is the book for you&#151;no other vegetarian cookbook comes even close. Author Carol Gelles has spent years creating recipes for a variety of tastes and needs, whether you&#39;re a beginner vegetarian, long-time vegetarian, or someone trying to eat meatless meals just a couple of times each week for better health. If you&#39;re a vegan (a vegetarian who doesn&#39;t eat eggs or dairy products), you&#39;ve probably been frustrated in the past by vegetarian cookbooks that don&#39;t address your needs. Again, no other cookbook offers you as many choices as 1,000 Vegetarian Recipes, with hundreds of vegan recipes throughout (all clearly marked with a &quot;V&quot; at the tops of the recipes). And many of the lacto-ovo vegetarian recipes include vegan variations. You probably already know that the vegetarian lifestyle is a healthy one, but if you&#39;re looking specifically for low-fat recipes, those dishes are specially marked with a &quot;healthy heart&quot; symbol for easy reference. In addition to the 1,000 recipes, Gelles offers a bounty of information on vegetarian food, including cooking charts for beans and grains; shopping lists for stocking the vegetarian pantry; a glossary of ingredients; a lesson on the health benefits of a meatless diet; and menu-planning advice, with menu suggestions for every taste&#151;Chinese, French, Mexican, Indian, and more. Whether you already own a dozen vegetarian cookbooks, or this will be your first, 1,000 Vegetarian Recipes is the one cookbook a vegetarian can&#39;t do without. A Few of the Delicious Meatless RecipesOlive CaviarBlack Bean HummusCorn FrittersLeek and Wild Rice SoupStuffed Young EggplantsSpiced Couscous with Diced VegetablesSpringtime PastaBulgur with Summer SquashMushroom-Leek TartLentil Shepherd&#39;s PieA Main Selection of the Doubleday Health Book Club and a Featured Alternate Selection of the Literary Guild Doubleday Book Club and Crossings Book Club."}, {"asin": "002542730X", "title": "Politically Correct Bedtime Stories: Modern Tales for Our Life &amp; Times", "description": "James Finn Garner has taken 12 time-tested tales and retold them with the newfound sensitivity of our times. Here's a snippet from &quot;Little Red Riding Hood&quot;:The wolf said, &quot;You know, my dear, it isn't safe for a little girl to walk through these woods alone.&quot;Red Riding Hood said, &quot;I find your sexist remark offensive in the extreme, but I will ignore it because of your traditional status as an outcast from society, the stress of which has caused you to develop your own, entirely valid, worldview. Now, if you'll excuse me, I must be on my way.&quot;Leap into a fairy-tale world where trolls are &quot;dirt-accomplished and odor-enhanced,&quot; witches are &quot;kindness-impaired,&quot; and Cinderella wears a gown &quot;woven of silk stolen from unsuspecting silkworms.&quot;  We can only regret that Garner had to exclude &quot;The Duckling That Was Judged on Its Personal Merits and Not on Its Physical Appearance&quot; for space reasons."}, {"asin": "0025853503", "title": "Gone With the Wind, The Margaret Mitchell Anniversary Edition", "description": "\"Let's say you've read \"Gone with the Wind\" at least twice, and seen the movie over and again. So, here's a thought. Buy this handsome paperback edition, just for Pat Conroy's preface. This passionate, nearly breathless love letter is a Song of Solomon to Margaret Mitchell, Scarlett O'Hara, and Conroy's beautiful, GTW-obsessed mother. Indeed, his luminous preface packs a durable wallop, just like the epic Pulitzer prize-winning work that inspires it.\" -- Jan Karon, author of \"The Mitford Years\" series--This text refers to an out of print or unavailable edition of this title."}, {"asin": "0026045702", "title": "JOY OF COOKING", "description": "Since its first private printing in 1931,The Joy of Cookinghas been teaching Americans how to cook.Craig Claibornecalls it &quot;a masterpiece of clarity&quot; andJulia Childsays it's the one book she'd keep if she could only have one English title on the shelf. The nearly 5,000 recipes are handily organized by meal and ingredient, and no cooking instruction goes unexplained, so you canfinallyunderstand the difference between poaching and braising. The book includes nutritional information as well as an extremely helpful list of measures and equivalents. You'll find a version of every recipe your mother ever cooked, along with straightforward instructions for cooking more exotic specialties such as turtles and muskrats."}, {"asin": "0026009102", "title": "The Fountainhead", "description": "The Fountainheadhas become an enduring piece of literature, more popular now than when published in 1943. On the surface, it is a story of one man, Howard Roark, and his struggles as an architect in the face of a successful rival, Peter Keating, and a newspaper columnist, Ellsworth Toohey. But the book addresses a number of universal themes: the strength of the individual, the tug between good and evil, the threat of fascism. The confrontation of those themes, along with the amazing stroke of Rand's writing, combine to give this book its enduring influence.--This text refers to thePaperbackedition."}, {"asin": "0026124157", "title": "July 2, 1903: The Mysterious Death of Hall-Of-Famer Big Ed Delahanty", "description": "A drunken and abusive Ed Delahanty, baseball's best-known slugger at the turn of the century, was put off a train on the Canadian side of Niagara Falls and either jumped, fell or was pushed to his death. This study by Sowell ( The Pitch That Killed ) adds nothing to the information previously available, and it is only secondarily about Delahanty in any case. The book concerns the baseball wars of the period 1890-1905, with the National League well established, the American League struggling for recognition and a league founded by players done in by the owners. It's a story of athletes leaping from one team to another in the search for big bucks ($4000 a year) and a good examination of an exciting era in baseball history. Photos not seen by PW.Copyright 1992 Reed Business Information, Inc."}, {"asin": "0027136701", "title": "Caddie Woodlawn", "description": "At age 11, Caddie Woodlawn is the despair of her mother and the pride of her father: a clock-fixing tomboy running wild in the woods of Wisconsin. In 1864, this is a bit much for her Boston-bred mother to bear, but Caddie and her brothers are happy with the status quo. Written in 1935 about Carol Ryrie Brink's grandmother's childhood, the adventures of Caddie and her brothers are still exciting over 60 years later. With each chapter comes another ever-more exciting adventure: a midnight gallop on her horse across a frozen river to warn her American Indian friends of the white men's plan to attack; a prairie fire approaching the school house; and a letter from England that may change the family's life forever. This Newbery Medal-winning book bursts at the seams with Caddie's irrepressible spirit. In spite of her mother's misgivings, Caddie is a perfect role model for any girl--or boy, for that matter. She's big-hearted, she's brave, and she's mechanically inclined!(Ages 9 to 12)"}, {"asin": "0027888304", "title": "The Moon Lady", "description": "On a rainy afternoon, a woman shares with three restless granddaughters her \"earliest memory\" from her childhood in China. Adapted from Tan's The Joy Luck Club , the haunting tale that unfolds is worthy of retelling--and of repeated rereading. The narrator, Ying-ying, recalls waking up at the age of seven on the morning of the Moon Festival; it was a steamy day, and \"the sun drove rays through the bamboo curtains like knives.\" Filled with similarly vivid images, Tan's lilting text conveys Ying-ying's contagious excitement about the festivities. These include the appearance of the Moon Lady, who can fulfill one's secret wish. Later, celebrating with her family on a \"floating teahouse,\" Ying-ying loses her balance and falls into the lake, where she is caught in a fisherman's net. He returns her to shore, where her secret wish is granted: she is found by her family, and thus learns a lesson about which kind of wishes come true. Tan has done a superb job of distilling this incident for young readers, who will be as mesmerized by the expressive narrative as by Schields's ornately detailed paintings, ablaze with luminous color. Ages 6-up.Copyright 1992 Reed Business Information, Inc."}, {"asin": "0028604199", "title": "Once Upon a More Enlightened Time: More Politically Correct Bedtime Stories", "description": "James Finn Garneris a writer and performer whose last book,Politically Correct Bedtime Stories,is an international bestseller. Called \"a master of the tour de force\" byThe Washington Postand \"a smart-alec, mealy-mouthed creep\" byThe London Daily Telegraph,Garner feels the truth lies somewhere in between. He lives in Chicago with his wife/lifemate and their new pre-adult.--This text refers to an out of print or unavailable edition of this title."}, {"asin": "0028610105", "title": "How To Cook Everything: Simple Recipes for Great Food", "description": "Mark Bittman, award-winning author of such fundamental books asFishandLeafy Greensand food columnist for theNew York Times(\"The Minimalist\"), has turned in what has to be the weightiest tome of the year. There are more than 900 pages in this sucker--over 1,500 recipes! This isn't just the big top of cookbooks: it's the entire three-ring circus. This isn't just how to cook everything: it's how to cook everything you have ever wanted to have in your mouth. And then some.Bittman starts with Roasted Buttered Nuts and Real Buttered Popcorn, and moves right along, section by section, from the likes of Black Bean Soup (eight different ways), to Beet and Fennel Salad, to Mussels (Portuguese-style over Pasta), to Cream Scones--and he hasn't even reached seafood, poultry, meat, or vegetables yet, let alone desserts. There are 23 sections in this cookbook (!) that reflect directly on the how-to of cooking, be that equipment, technique, or recipe.Every inch of the way the reader finds Bittman's calm, helpful, encouraging voice. \"Anyone can cook,\" he says at the beginning, \"and most everyone should.\" More than a few college kids are going to head off to their first apartments with Bittman's book under arm. More than a few marriages will benefit with this book on the shelf. And anyone who loves cooking and the sound of a great food voice is going to enjoy letting this book fall open where it may. No matter what the page, it's bound to be a tasty and rewarding experience.--Schuyler Ingle"}, {"asin": "0028612671", "title": "Simply Heavenly!: The Monastery Vegetarian Cookbook", "description": NaN}, {"asin": "0028631412", "title": "Frommer's Born to Shop Paris: The Ultimate Guide to Travelers Who Love to Shop", "description": "These compact, handy guides are packed with insider tips on where to find the most fabulous fashions, the most unique gifts, and the best bargains on everything from antiques to housewares. Includes all the big names, and a Best of chapter that pinpoints exactly where to find the finest.  Also included is a handful of the authors favorite places to stay and eat."}, {"asin": "0028631528", "title": "Fish: Complete Guide to Buying and Cooking", "description": "From anchovy to wolffish, Mark Bittman, the executive editor ofCook's  Illustratedmagazine, presents fish and shellfish by name, offering discussions on preparation and presentation along with sumptuous recipes. Bittman proposes everything from traditional fare--Dungeness crab salad and marinated grilled salmon--to more complex dishes like curried mussels and raw sea bass salad. The more than 500 recipes are tried-and-true, and any cook with access to a decent fish market is advised to take full advantage of Bittman's expert and substantial overview. The book won the 1995Julia Child Cookbook Awardin the Single Subject Category.--This text refers to an out of print or unavailable edition of this title."}]