[{"reviewerID": "ATBGGCX75KLTT", "asin": "0028610105", "reviewText": "This is the ideal book for anyone.  It has everything you can think of in it.  I was going to give it to by daughter, but I think I will keep it.  My husband is always asking how to make???  so now he can!"}, {"reviewerID": "A1V0EJ9FTATZSC", "asin": "0007230206", "reviewText": "I agree with the first two reviewers concerning the over abundance of detail.  I found myself constantly referring back to the list of characters and not always finding the object of my search.  A rudimentary map of the English countryside would have been helpful, also.  Just to read that a character is being moved to another castle really doesn't mean very much.  I have read a few books about this period, and I can't say that I learned anything new from this book. I would have liked to learn more about Thomas Cromwell and others in the Tudor court, but I just got lost in all the verbiage.  In fact, I'm quitting at only about two thirds of the way through.  This may be a great book for the serious history student, but not, I think,  for the casual reader."}, {"reviewerID": "A19XXXTLGQE42V", "asin": "0007456816", "reviewText": "Thelma Madine writes well, keeps the pace up and shows her true spirit.  I hadn't seen much of the Gypsy Wedding programme so enjoyed her story.  Like many of us, she has had her ups and downs and come out on top, showing her grit and determination.  A thoroughly enjoyable read."}, {"reviewerID": "AD3D23RISLTLQ", "asin": "0007444117", "reviewText": "I just finished this book. The third in the series and I cried like a baby at the end of book 3... You have to read this series... This book was AMAZING!!!!!!"}, {"reviewerID": "A3HZJ7EMASG1ZZ", "asin": "0002247399", "reviewText": "Bought for a gift. Have no idea what it is all about. Don't think it would be my cup of tea as reading material but others must really enjoy it, as I was asked for Book 5 in the series."}, {"reviewerID": "A32LL8P0QS5BE7", "asin": "000639325X", "reviewText": "I REALLY LIKED THIS BOOK.  COULD HAVE BEEN BETTER PROOFED FOR ERRORS, BUT ALL IN ALL A VERY INTERESTING READ."}, {"reviewerID": "AF0FQL7TGEFQU", "asin": "0007167040", "reviewText": "One of the best books I have ever read.  Constantly give it to others as a gift. It is a wonderful story of how hope can work miracles."}, {"reviewerID": "A16QQ78I8J29PA", "asin": "000720311X", "reviewText": "Dean Koontz is one of my favorite authors, but his recent output has been pretty uneven.  Nowhere is that more true than with his Frankenstein trilogy of books.  The first novel in the trilogy, PRODIGAL SON, was hugely enjoyable, a tightly written horror story filled with loads of suspense and humor.  The second entry, CITY OF NIGHT, was a pale imitation of the first, but was adequate enough.Inexplicably, Koontz waited four years to produce the final entry in the trilogy, DEAD AND ALIVE.  Of course, such a long delay raised the expectations for this novel exponentially.  Unfortunately, this rather short novel is only fair, and certainly not worth the long wait.DEAD AND ALIVE is by no means terrible -- it's actually pretty well written and contains a lot of interesting ideas.  Koontz is a highly imaginative writer and this book contains its share of mind-blowing moments.  But like a lot of Koontz's recent efforts, this book falls down in the plot department.  This book really just consists of a series of repetitive scenes that are only loosely connected with one another.  The end result is a book that lacks narrative drive.Koontz also goes overboard with his satirical tone in DEAD AND ALIVE.  The first book in the Frankenstein trilogy had its share of humor, but it was restrained enough to be believable.  In this novel, the joking is so excessive that it becomes difficult to take the storyline seriously.  I often found myself rolling my eyes at all the over-the-top silliness.In the end, DEAD AND ALIVE is okay, but like most reviewers I was ultimately disappointed.  Reportedly, Koontz is writing a new Frankenstein trilogy -- I hope he spends more time on developing a plot that can carry three whole books."}, {"reviewerID": "A1HARURW1XRPMA", "asin": "0002007770", "reviewText": "As a person who usually reads non-fiction books about science and psychology, I thought I'd give myself a break and see what all the hype surrounding Water for Elephants was about. I was not disappointed. It was not the best book I've ever read, but it was very entertaining and a pretty quick read. I was explaining to someone that the story is very formulaic: guy wants girl, can't have girl, ends up getting girl - but it was set against a different backdrop than others. Sometimes that's exactly the kind of book you want to read."}, {"reviewerID": "A1MS8JXBZ8FAKU", "asin": "0007281447", "reviewText": "The best sports book I've read in a long time.  Agassi is painfully honest and truthful in telling his story.  His humanity and insecurities are what make this champion a real human.  It is a fast read with little of the self-aggrandizment found in so many books of this nature.  The photo of the dust cover speaks for him.  The words inside speak directly to the heart and speak clearly.  If you limit yourself to a few &#34;sports&#34; books make this one number one on your list."}, {"reviewerID": "A15DLG41650O0X", "asin": "0007124015", "reviewText": "You can't say you didn't get what you paid for. These colossal books, filled with adventures, can certainly keep a person occupied, but as a general warning, these aren't those \"glove-fits-all\" books. You have to be in the mindset for an epic fantasy battle, and though I wasn't, my classmates who read the entire trilogy absolutely adored the stories. I would highly recommend reading The Hobbit before attempting to digest the trilogy, just so the concepts of hobbits, wizards, and Middle Earth, will be old hat."}, {"reviewerID": "A1QQEFV51EMD7E", "asin": "0002007770", "reviewText": "In the great depression, a young man drops out of Veterinary school and joins a travelling circus. The story unfolds in flashbacks from his present day existence in a nursing home. The author takes us into a world of cruelty, privation and danger, which is nevertheless full of adventure and the possibility of love. The story grabs you quickly. I couldn't put this one down. I told my friends about it, and the ones who actually started it were hooked too!The writer creates believable characters, and I found myself caring about them. Perhaps some were larger than life, but it helped the story. Was the circus really this grim and dangerous in the 1930's? I do not know, but Sara Gruen makes it entirely believable.This book occupied all of my spare time for several days, and that is just what I hope for when I pick up a new one. The ending was a little bit contrived, but I have forgiven authors for much worse. Get your hands on this one; you won't be sorry."}, {"reviewerID": "A398WCTKA2RDVC", "asin": "0026124157", "reviewText": "Sowell's book is a lively account of the tragic final days of the great Ed Delahanty, the only player to win batting titles in both major leagues, as well as the opening days for MLB  in 20th century. Big Ed, a hard-hitting and hard-drinking Irish-American from Cleveland, was a notorious team jumper during the biding wars between the established National League and the brand new American League.  The big money Ed made was lost at the racing track and his fate was sealed when it was  decided by the big boys of baseball that he owed John McGraw's Giants the advance he took on his salary. Did Ed jump off a lonely bridge in Canada, or was he pushed, or did he simply stumble off and into his watery grave? A great re-telling of an old story from a period long forgotten.  Highly recommended."}, {"reviewerID": "A9X290PLHYXX8", "asin": "0007493754", "reviewText": "I love Terry Goodkind and I love how he has stayed with the same people we know and love. I love the way it kept me guess as to what would happen next"}, {"reviewerID": "AS2PXNV3VLZGX", "asin": "0020291922", "reviewText": "this was a great account of a survival story in Auschwitz. yes, there were mistakes in the editing deparment of the book, but to me this didn't take away the suffering Primo Levi must have encountered. i gave it 4 out of five stars due to the badly edited print. otherwise i am recommending this book for the story that is told in this book."}, {"reviewerID": "A3H926Z7WBJSOO", "asin": "0007137508", "reviewText": "I have studied Napoleon for a good while yet this is the first biography I have ever read about the Duke of Wellington. Mr. Holmes does a good job of going through all of Wellington's life without getting into nitty gritty details. The book is roughly 200-250 pages and covers all of Wellington's life from his birth, the campaigns in Flanders, India, Spain, Waterloo, and his prime ministry. The military campaigns are covered in adequate detail, enough to know what happened, but not enough to confuse the reader or draw a military thesis statement from. The same goes with regards to his session as prime minister. So bottom line is if you are looking for a good book on the Duke that is an easy read and covers his whole life in a concise single volume, I strongly suggest this one."}, {"reviewerID": "A2OQGF5N162TCR", "asin": "0007491433", "reviewText": "I had read one review of this book which made me buy it and I am so glad I did. The character of Matthew reminds one of Christopher in 'The Curious Incident of the Dog...' but this book is deeper and darker. It is written simply, but is multi-layered wrt to time, and this, I think, adds to the novel. It is a compelling read -  if you've got 4 - 5 hours, read it in one go. I sincerely hope Mr Filer is not a one-book author....!"}, {"reviewerID": "A3FDC5GMW7WCOJ", "asin": "0007230206", "reviewText": "It is not often that one reads a book this well written, with characters so well drawn that one can identify them just from the brilliant dialogue. What was distant history comes alive as the reader is given a &#34;fly-on-the-wall&#34; view of how events might have occurred. This book kept me gripped to the very end and I immediately purchased the sequel &#34;Bring up the Bodies&#34;."}, {"reviewerID": "A3JLT0W4F1FVIS", "asin": "0007444117", "reviewText": "What was a fresh concept in Divergent went off track in Insurgent, but made up for it with a shocking ending. Well, Roth stuck to that formula, except it seemed like a) Nothing happened in Allegiant and b) the entire book was merely a set up for a *shocking* and rushed ending. The plot holes were head-scratching and there wasn't enough emotion/too much repetition to build any depth.Not recommended."}, {"reviewerID": "A3N3OMFWDPHMKW", "asin": "0002247399", "reviewText": "I bought this for my wife, who read the first four books and loves this one. It's the right combination of fantasy, plausible historical setting, conflict and character development. Probably not something to keep on the shelf for future reference, so a good choice for Kindle."}, {"reviewerID": "A38JMQTWLZUMWC", "asin": "0007442920", "reviewText": "I loved this book, almost more than the first one!  I also love that the story lines, while related were completely different, yet still just as interesting and thought provoking.  I wish I didn't have to wait so long for the next one to come out!"}, {"reviewerID": "A38L8NSWMZ84OC", "asin": "0007145160", "reviewText": "The Yoga Sutras of Patanjali are a simple, clear series of aphorisms designed to help a person realize that the human mind is controllable.I read a portion of them daily. This  famous yoga author proves that too many words can muddy even the clearest water.As Patanjali himself said, \"There is knowledge of everything through intuition\".I feel there are too many books written on \"how to\" understand spiritualteachings, and that this is another one.There are many translations of the Sutras available. Buy one, and if, after reading it, you need someone elses opinion, buy this book."}, {"reviewerID": "A3LKWMM12AF0PU", "asin": "0026009102", "reviewText": "I saw the movie years ago -- and was I floored.  Man, what a movie.I ran to mom and told her the greatest old movie I just saw about an architect and his troubles and how he overcomes it all and becomes the greatest of all time.  She said, \"you think the movie is good, read the book.\"Fast forward 30 years.  I run to the store and pick up a copy. I sat down hoping to get past the first chapter.  Before I got up, I was on page 150. The print was horrible, the size of the pica petite, and yet my old eyes could not get away from the richly textured and tremendously clever and seemingly contrarian dialogue.She is a master. The story is great (except the acceptance of an apparent date rape in the middle which by today's standards would not be forgiven). I rave about this book.Now, mother tells me to read ATLAS SHRUGGED. I will.  But, this time I am going to the library and getting the hardback with better print."}, {"reviewerID": "A1C6BH2B4U6TT6", "asin": "0007169914", "reviewText": "Excellent!  It's Dr. Seuss!"}, {"reviewerID": "A348N6QHEUYR5I", "asin": "0007444117", "reviewText": "I almost didn't read this book due to all the whiny 1-star reviews. However, I wanted to find out how the story ended. And... actually it ended how I honestly expected it to end. So if you actually liked the story - not just the love story - and are genuinely interested to find out more about their world, why the factions exist, and a realistic ending, then definitely read this book. I thought it was great.*SPOILERS*So it didn't end as I wanted. Of course I wanted Tris and Tobias to be together in a peaceful world at last... but the ending was realistic. Tris put herself in so many ridiculously risky situations through the trilogy, that her luck was bound to run out.  I was glad to see tension in their relationship finally start to rear its ugly head, because in that type of situation where they are around death constantly, making decisions that may/do put their family and friends' and own lives in danger... not really conducive atmosphere for a perfect love affair. The honeymoon had to end at some point. And you had to know with allll the millions of times Tris thought about giving your life for love... sacrificing... etc.  You can't tell me you didn't expect that ending!!!"}, {"reviewerID": "A2OCA6XPM8U4WE", "asin": "0007442920", "reviewText": "I really enjoyed the pace of the book and trying to figure out why their world is like it is. Liked Tris and Four and their interaction. Still not totally on board with the whole serum thing. But dystopian books always have a few hinky things in them. It's still a good read."}, {"reviewerID": "A3UV7L5ND3EH8T", "asin": "0007192932", "reviewText": "\"Whether you perceive the witch as powerful or evil may depend upon whether you perceive knowledge as desirable or dangerous; whether you perceive that human knowledge is something that should be limited. The witch doesn't think so. She, or he as the case may be, wants to know.\" -from the bookFrom shamanic shape shifting to food and drink, botanicals to sacred days, The Element Encyclopedia of Witchcraft - The Complete A to Z of the Entire Magical World is a fascinating and comprehensive celebration of all facets of witchcraft. From modern Wicca to Egyptian sorcery, Toltec shamanism to African Voudon, author Judith Illes explores the history, folklore, spirituality, and practices of witchcraft and the occult. According to Judika Illes, there are many definitions and beliefs about what a witch, and witchcraft, embodies. In the introduction, she examines the many theories, definitions and attitudes that have accompanied this oft-misunderstood subject.This book celebrates the fun, freedom, mystery and defiance of witchcraft, rather than any specific spiritual or political definition. Thus, this hardcover authoritative reference, which spans 887 pages, covers the people, places, professions, deities, traditions, books, film, fairy tales, animals, herbs, holy days, mythology, tools and symbols spanning hundreds of occult traditions. Topics are arranged alphabetically, and the main chapters are:Elements of WitchcraftBooks of Magic and WitchcraftBotanicalsCalendar of Revelry and Sacred DaysCreative ArtsDictionary of Witchcraft: A Magical VocabularyThe Divine Witch: Goddesses and GodsErgot, The Corn Mother, and The Rye WolfFairiesFairy-Tale Witches and Mother GooseFood and DrinkThe HagThe Horned One and The DevilMagical ArtsMagical ProfessionsPlaces: A Witch's Travel GuideTools of WitchcraftWitchcraft Hall of FameWitchcraze! Persecution of WitchesWomen's MysteriesWormwood and Garlic: Dangers and ProtectionsThe Element Encyclopedia contains intriguing information like:* The difference between almanacs, books of shadows, and grimoires* The colorful origins and uses of absinthe* In the book The Wonderful Wizard of Oz by L. Frank Baum, Dorothy's slippers were silver, not ruby. She is identified as a sorceress because she wears white and, according to the book, \"Only witches and sorceresses wear white.\"* Prospero, the magician in Shakespeare's The Tempest, is believed to at least partially to be based on Dr. John Dee. Dr. Dee was famed astrologer to Queen Elizabeth, as well as a renowned alchemist, magician and scholar. This brilliant occultist was one of the founders of Enochian Magic.* If a plant contains the word \"bane\", beware! The word bane is a derivative of the Old German word bano meaning death. Thus, any plant containing \"bane\"-such as wolfsbane or henbane-is poisonous.* The character of Sabrina the Teenage Witch didn't begin with Melissa Joan Hart. She first appeared in the back pages of an Archie Comics magazine in October 1962. She was featured in her own comic book in April of 1971.* Psychopomp is a Greek word for a spirit who serves as an escort between the realms of the living and the dead. Hermes and Hecate are two well-known psychopomps.* Corn Mother myths span many cultures, and include Demeter, Baba Yaga, Ezili Dantor, and Saramama.* Cailleach (pronounced \"coy-luk\") is a Gaelic word often translated as hag. In Scottish and Irish folklore, Cailleach is a term for spirits corresponding to the archetype of the sacred hag.The Element Encyclopedia of Witchcraft is an utterly fascinating read.  Not only is it a source of browsing entertainment (I open it every chance I get!), but also is a rich source for research and study. For those who love the elements of witchcraft or identify with the Witch archetype-as well as those who are fascinated by mythology, history, trivia, and the magical arts-this book provides a comprehensive, yet lively, wealth of information that is sure to provide hours of enjoyment.Janet Boyer, author of The Back in Time Tarot Book: Picture the Past, Experience the Cards, Understand the Present (coming Fall 2008 from Hampton Roads Publishing)"}, {"reviewerID": "A1G5VQ1UNS0OMK", "asin": "002542730X", "reviewText": "I have been avoiding this title for years under the mistaken assumption, and fear of sorts,  that this would be yet another PC rehash of the traditional fairy tales that I loved so much as a kid, and today find interesting for the light they throw on folklore and pre-modern society. Imagine my delight when I eventually did get round to reading it! Make no mistake, this book is a satire on excessive PC, which has sunk its teeth into every aspect of our lives, even into classics and fairy tales. Judging and rewriting the past by today's standards is stupid and futile, and this book shows that clearly. I'm giving this one star less simply because there could have been more, and if you're on a tight budget, it may pinch a little."}, {"reviewerID": "A1FHL63XEB10V1", "asin": "0020315910", "reviewText": "The point of the novel, like so much of PKD's work, is centered on the issue of what is Real and what is perception.  This is one that has a &quot;science&quot; concept at the front of the novel that is quickly dispatched(the beam machine is just an effect, and PKD shows it as such) but the story is about how each of us is in our own little perceptual world, defined more by who we really are than anything else."}, {"reviewerID": "AVUZRNQBB3S6G", "asin": "0006514359", "reviewText": "What suckers we mortals be!  I've no idea whether the author has been or  is able to write a good book.  Apparently he has developed some following  among readers of formulaic derring do.  But that aside, every book should  stand on its own, and this one was obviously tossed off in a week or so by  a bored and complacent writer and produced by an equally bored and cynical  publisher confident that the author's fans would shell out once again. This  piece, aside from its cardboard characters, ridiculous plot, and total  failure to develop any atmosphere for the numerous locations among which  the protagonists hop, is replete with grammatical and typographical  bloopers that no self-respecting writer or editor should commit. However,  this quality of work is becoming more the norm than the exception in pop  fiction. The state of modern fiction of this sort may be one good indicator  of the state of our educational system."}, {"reviewerID": "A386UNUYDUDSBB", "asin": "0007447868", "reviewText": "A Feast for Crows is not a bad book. George R.R. Martin is still a good writer, both in the technical sense (solid prose and dialogue), and with regards to character development. Unfortunately for this book, though, it's the fourth in a series, and we readers have certain high expectations; someone coming to it without reading the previous three might not understand what everyone's complaining about, but that person wouldn't understand much of anything because these books are anything but standalone.So the problems here are mostly editorial decisions. The biggest one is the pacing: chapters are suddenly twice as long, but very little happens in them. There are three central POV characters: Brienne, who spends the whole book wandering the riverlands (now Arya's gone somebody has to do it) looking for Sansa--a dull plot if there ever was one, as we know where Sansa is and that Brienne won't find her; Cersei, who tries to rule King's Landing but sees little action until the last chapter or two (I'd been looking forward to finally seeing into her head, but what was there disappointed); and Jaime, who is involved in several events of secondary importance, but for the most action-oriented plotline in the book, his is somewhat lacking. All of these plotlines, as well as the more minor ones, are as well-written as they can be and are placed in wonderful, three-dimensional settings, but the readership has gotten used to several huge, game-changing events per book, and that they don't provide.Then there's the decision to include secondary plotlines, with one or two chapters per POV character. This is a bad call in my mind not only because we've seen how quickly Robert Jordan's series devolved once he began to focus on secondary characters we cared little about, but because neither the Dorne nor the Iron Islands plotline is that fascinating. In the previous three books, the offstage events added depth to the story, and I fail to see why the same technique couldn't have been used here. The kingsmoot is excellent and would have made a great prologue or epilogue, but the other Iron Islands chapters are dispensable. And it seems to me that the entire Dorne plotline could have been eliminated without any great loss, although if Martin wanted to keep it, he could easily have elevated Arianne to the status of main character and written the entire subplot from her perspective. That brings me to another point, though: Martin's portrayal of women's sexual behavior leaves something to be desired. He seems to believe that teenage girls losing their virginity on one-night stands is the norm rather than the exception, especially bizarre in a culture as obsessed with virginity as the one he's created. This stands out coming from an author whose portrayal of women is otherwise quite good, particularly for fantasy.Ultimately, this is a decent book; it's not trash, but I don't believe that the slow pacing or even the division into two books was really necessary. Here's to hoping Martin returns to form with A Dance With Dragons!"}, {"reviewerID": "A3FDT46205WHLP", "asin": "0007504586", "reviewText": "No idea whatsoever how or why, but WHERE THE DEVIL CAN'T GO by Anya Lipska wafted into my somewhat dodgy attention span recently, and I started reading it immediately. As in read the sample, bought the ebook and read it as soon as it downloaded.Sometimes the universe is very kind and benevolent place, because this is an excellent debut book. Set within the Polish community in England, I think I've since heard somewhere that this is the first novel of this sort out of that environment.The story is set deep within that Polish community, many of whom are in England for work, escaping economic deprivation and sometimes official persecution in their homeland. The timeline is before the London Olympics, with much of the community working on building the Olympic venues.Janusz Kiska doesn't work as a builder, rather he's an unofficial \"fixer\" for the community, a solid, taciturn man with a past and strong connections back to his homeland. One of the very early Polish arrivals in England, he sees things as a migrant, and as a long-term resident. Believable, fascinating, approachable although slightly stand-offish and touchingly sentimental, Kiska is a strong man with a strong sense of right and wrong. Thoughtful, calculating, clever and not above rule bending if required, his connections extend from recent arrivals, through to the religious hierarchy of the community and many of the leaders and power-brokers in both Polish and English society.Natalie Kershaw is a young detective trying to forge her way in the male dominated police force. Her struggles in the force make her another outsider, especially as she's not against breaking a few rules herself. Starting a relationship with a workmate is probably the biggest rule she could have broken. Despite her doubts, she is supported by her boss, and whilst her colleagues might be a bit tricky, a large percentage of the problems she experiences could be put down to her own attitude. She's touchy, prickly and as believable as Kiska.These two characters form less alliance, more a ceasefire when their cases of missing or dead young women connect up. Kiska working within the community and Poland with knowledge of the people, their superstitions and the language on his side. Kershaw with scientific and, eventually, the support of police resources behind her.There's a lot working in this book. The characters are strong, and whilst we have a pairing of male and female, the romantic complications are in other directions. The plot elements are cleverly unpredictable, relying on the evils of money, drugs and sex as well as politics, influence and corruption. The book also takes the reader into a community that's not as well known, at least in these parts. Along the way there's some light cast about a background and the consequences of migration and marginalisation which was elegantly done.Like it when a debut book puts an author on my \"to be bought immediately\" list. WHERE THE DEVIL CAN'T GO was finished in a couple of greedy reading sessions, DEATH CAN'T TAKE A JOKE pre-ordered immediately. It's going going straight to the top of the pile come March 2014.[...]"}, {"reviewerID": "A3D2RBTE5B5B17", "asin": "0006478840", "reviewText": "I have read much that has been written about King Henry's wives. This novel gave so much more personal in depth information. Seeing it all through Katherine's eyes was spellbinding."}, {"reviewerID": "A2EFXF4843T1OD", "asin": "0002247399", "reviewText": "I'm one of those people who can often see what's coming in books, TV shows or movies - but not here! Even in the 5th book, Martin's series still manages to shock me. I love it."}, {"reviewerID": "A2FZYDTG24QGDH", "asin": "0007442920", "reviewText": "I am always leery of a book sequel, but if possible this book was even better than it's predecessor! I cannot wait for book 3!"}, {"reviewerID": "A3S8N9TDVWUUPX", "asin": "0007447868", "reviewText": "There are so many dead throughout this book that I'm sure the crows all over Westeros and beyond had quite a feast. Now I guess death is just part of the bargain when you are trying to hold a kingdom or trying to get a hold of one. This book like the others is also full of suspense, fighting and adventure.Now that I reread the first 3 books of the series, this book makes more sense now. The first time I read it 5 years ago I didn't remember many details of the first 3 so I was kind of lost. On this one, I do love Jaime Lannister even more. He's turning out to be a great man. His sister, Queen Cersei is totally the opposite. She was mean to begin with, but now she's turning out to be the Queen of Evil. However the tables start turning for her. Let's see what Lannisters are made of.Arya Stark is becoming of age the hard way, but she lives to the fullest. Sansa Stark gets a new identity, and Brienne is out on the look her. Slowly but surely we start to glimpse other sides of the plot, like what goes on in Dorne, where princess Myrcella was shipped by the Imp, and the politics that are at stake. Samwell Tarly gets to see the world on his trip to Oldtown, and learns quite a few interesting things from Maester Aemon. I'm finally ready to start reading A Dance with Dragons, can't wait to start."}, {"reviewerID": "A339RGZW3OYLRD", "asin": "0007148976", "reviewText": "Had to read this book for my daughter's 1st book report so I knew how to help her. Chose it in honour of Halloween and the history it provided of Witch Trials in the 1600's. I loved it and loved more the lessons it teaches kids about not judging people based on other people's opinions or gossips. Make your own judgements, do what you think is right, and above all do not be afraid to be yourself."}, {"reviewerID": "A11UAS6UUFRG7I", "asin": "0007167040", "reviewText": "I can't believe the reviews on this book!  I read it months ago, and found it long-winded and boring.  I am not a horse person, and truthfully, after reading this book, I find myself not wanting to ever go to the horse track...  I am shocked sometimes by what novels capture the &quot;common folks&quot; attention.  Literature this ain't!!!  Beach reading this ain't!!!  I need to read a book to help me fall asleep; now that's the rub."}, {"reviewerID": "A35U3PVERCQND7", "asin": "0007386648", "reviewText": "Laura has penned a superb novel, one that every American should read.  It is one of the most vivid and inspiring books I've ever encountered.  On top of that, Tony Duva, my boot camp company commander of 62 years back, shows up on four separate pages."}, {"reviewerID": "A1BIM9IHS50B70", "asin": "0007444117", "reviewText": "Just as good as the first two novels, Veronica Roth keeps you hooked all the way to the end. All three books are compelling, believable, and every character is like someone you know."}, {"reviewerID": "A2FWYHZDOMD92Q", "asin": "0007113080", "reviewText": "Wow.  This book (and the sequel, The Hidden Warrior) are excellent prequels to her Nightstalker series (Luck in the Shadows, Stalking Darkness, and Traitor's Moon).  These two tell the story of Tamir, hidden for most of her young life in the body of a boy, Tobin, and brought up as Companion to her cousin Prince Korin.The magic of Skala, its wizards and hedge-witches, is believable and the beginnings of the Third Oreska (which we see in later years in the earlier series) is fascinating."}, {"reviewerID": "A19XE6G6NDZFPS", "asin": "0007281048", "reviewText": "It's hard to imagine the kinds of horrific circumstances some children are born into. And yet, these kinds of &#34;homes&#34; are sadly more common than we think. Powerless to help themselves, the young victims must often wait until a shrewd teacher or other adult notices something amiss, and contacts the authorities in a position to make a change.That's precisely what happened to 10-year-old Donna, and her younger brothers Jason and Warren. Once removed from an extremely filthy and neglectful home by child protective services, the adults involved slowly began to glimpse more and more horrific details of the almost unfathomable levels of abuse suffered by the children, especially Donna. For reasons that Cathy Glass, Donna's foster carer and author of this story, could not understand, young Donna took the brunt of the abuse - even from the 6- and 7-year-old brothers, who were instructed by their mother to help beat their sister.But as always, Glass - a foster parent for over two decades - put her all into attempting to help improve Donna's life. With her loving yet no-nonsense attitude, Glass used her usual approach of trying to integrate Donna into a normal child's life while also encouraging her to speak about what had happened to her in the past in the hopes of Donna's beginning to heal emotionally.Despite the serious and potentially depressing subject matter, readers should not be scared off from taking on Donna's story! Glass's unique style manages to tell the details while in no way dramatizing or focusing upon the negative - although, of course, if anyone in this world has a right to ask &#34;why me?&#34; it would certainly be a child like Donna. Instead, Glass never stops hoping, both for Donna to heal and find peace, and even that Donna's family will be able to do the same."}, {"reviewerID": "A3EWRAVMKVUUVL", "asin": "0007386648", "reviewText": "I wasn't going to purchase this book...then I read the preview.  I couldn't put it down!  I thought some parts of the story kinda drug out, but it is hard to believe the guy lived through everything they went thru.  I've read alot of books on POW's from that era, but none ever really followed through on the life after repatriation.  I was really amazed at the way the story was written as a biography of Louis Zamparini, but also included memories by his friends as well.  Also the way one was treated after returning home and the way the other guy was kind of a shadow who followed Louis!  What a powerful story!  I would recommend this book to any student of military history of a POW and the struggles of what is now known as PTSD.  As a veteran myself, it was a great book. Thank you for writing it! I recommended the book to my sister, and she ran right out and bought the hardcopy.  She told me the same thing....she couldn't put it down!"}, {"reviewerID": "A2XK071VCVSSUC", "asin": "0007442920", "reviewText": "Second book to the Divergent series. If you read the Hunger Games series, you would most likely enjoy reading the Divergent Series. This three book series is wonderful. I have finished the entire series and I really liked it. If I am not mistaken the series is listed as a youth type series. I have teenage nieces who love to read and tell me about the books they read that are really good. I find most the books they recommend that are for youth (young readers) to be very good and this series is one of them."}, {"reviewerID": "AJIV9J8XEC0VO", "asin": "0025429655", "reviewText": "This is the most total book I have found on the foods that I love.  It has 1000 recipes that are vegetarian and I just can't believe that I have it.  The price wasfantastic and the book has some of the best recipes.  The book was found on Amazon.com, came to my house quickly and in excellent shape."}, {"reviewerID": "A3CAK8P3T5ESFN", "asin": "0002219417", "reviewText": "The book clarified some of my misconceptions about the events leading to the second world war. Creation of a story makes the reading of history much more interesting. I really enjoyed reading it."}, {"reviewerID": "A147POPQFX732K", "asin": "0007148976", "reviewText": "The Witch of Blackbird PondBy: Elizabeth George SpearePaperback: 223 PagesPublisher: Dell Books (1973)ISBN: 0440995779 (isbn13: 9780440995777)Genre: Historical FictionTime Period: 1687Setting: Barbados, ConnecticutCharacters:Katherine (\"Kit\") TylerNathaniel (\"Nat\") EatonHannah TupperWood Family: Matthew, Rachel, Judith, MercyJohn HolbrookWilliam AshbyCruff Family: Goodman Adam, Goodwife Cruff, and PrudenceEleazer KimberlyThis book had the most profound affect on me and my life both as a reader and a woman. Kit Tyler is an impulsive and genuine young woman with a very strong mind with whom I definitely identified with. In this time in Puritan society this description isn't one that you want nor was it for me for a long while. The ability to identify with at least one character is always a good indicator of a story because the whole idea is to walk in an other's shoes no matter how different they are from your own.Also as with all great stories they have lessons that you are meant to take away from the story if it fails to do this then in my opinion the story no matter how entertaining it was, it was a waste of time. In regard to this book it is thoroughly riddled with ideas and morals, some very unexpected given the time period.It taught me that sometimes you just won't fit in but that doesn't mean you should change your \"feathers\":\"You know,\" he said, looking carefully away at the river, \"once ~hen I was a kid we went ashore at Jamaica,~ and in the marketplace there was a man with some birds for sale. They were sort of yellow- green with bright scarlet patches. I was bent on taking one home to my grandmother in Saybrook. But father explained it wasn't meant to live up here, that the birds here would scold and peck at it. Funny thing, that morning when we left you here in Wethersfield---all the way back to the ship all I could think of was that bird.\" -Nat EatonIt taught me what love is and shouldn't be:\"You and I would always be uneasy, ail of our lives. We would always be hoping for the other one to be different, and always being disappointed when it didn't happen. No matter how hard I tried, I know I could never care about the things that seem so important to you.\" -Kit TylerIt taught me love is sometimes hidden right in front of you.It taught me truth and loyalty are two of the most important things in life.Most importantly be yourself for the right people will love you more for that and the ones that don't, don't matter.As far as did the author succeed in their story, read the following quotes.\"I don't believe a historical novel should gloss over the pain and ugliness. But I do believe that the hero... should on the last page... still be standing with the strength to go to whatever the future may hold.\" -Elizabeth George Speare\"Every book begins with questions. How must it have seemed to people who lived through this experience? What choices would I have made in their place? I must find the answers by going back in the past, by living side by side with them until the world they lived in becomes as real to me as the room in which I am working. This is an enormously satisfying experience. I find that renewed perspective and a sort of reinforcement to the spirit...[are] gifts from the past that...a person of any age...can gain from reading...historical fiction.\" -Elizabeth George SpeareIf I am to judge the story based on these then the author most definitely succeeded on all counts.As far as eye-candy when it comes to covers this is my favorite cover of all the editions of this book. I love how she looks free-spirited even in the strict clothing of the Puritans. I like how the artist included water in the background because the difference in the water was one of the first indicators that Kit was no longer in clear blue Barbados water but rather the murky water of Connecticut. The cover also gives a hint of the wooded way the North used to be like during that time before the Industrial Revolution.Overall I give this book a five. It is a book you will want to give to any girl coming of age, or any woman at a crossroads in her life. Personally, I pick up a copy of this book whenever I can and have several editions that sometimes if I have doubles I tend to give away."}, {"reviewerID": "A1NQJXDRLMA5WU", "asin": "0007386648", "reviewText": "This is without a doubt one of the best books I have ever read in my life. It's just amazing that this hero is still with us today after going through all the horrors that he endured. I would like to congraulate Ms Hillenbrand for the amazing job she did in putting this great story to paper. I am so glad I was able to read this story before the movie comes out."}, {"reviewerID": "A12KUJT75HFO67", "asin": "0007124015", "reviewText": "Forget Harry Potter; forget the cheesey alien books.  Tolkien is the grandfather of all fantasy and can not be matched.Yes, these books can be a little dark and scary.  But the lessons clearly taught are valuable.  Each person is important and valuable.  Team work gets things done.  Absolute power corrupts absolutely.  And even the smallest of the smallest people can make a difference in the world.For younger readers, start off with C.S. Lewis.  But junior highers and older can handel this.  I even reccommend it for adults. Make it your summer reading."}, {"reviewerID": "A3FWHXV4CD87MD", "asin": "0007116055", "reviewText": "All through the book I was thinking \"oh this is great, please don't ruin it\". I thought this way because of the many books with \"bad ends\" that I'd read. I think the end is one of the most important aspects of a good book and so, while reading this one, I worried about the finishing of the story.The book talks about the eternal struggle between good and evil and for that purpose it gives a story. The story was smart and creative.However, when the end came, so did the dissapointment. Now, the final conclusion that Coelho had about the whole matter of good versus evil was brilliant. I do not know if I agree with it completely but I do know that I do agree with it to a great extent. It was a very wise and fair conclusion. However, the twist in the story that he used to come to that conclusion was not very convincing to me - in fact it was a big dissapointment. I just do not belive that people's minds can be changed so simply by a speech - specially one that, in my opinion, is not very strong.Bottom line: This book is nice to read and has a very well formulated idea about good and evil in human beings. I do recommend it. But I'm sorry it ended the way it did because it could have been MUCH better."}, {"reviewerID": "A2537OHABVX75J", "asin": "0007444117", "reviewText": "Like many others, I eagerly awaited Allegiant to be released this week.  Also like many others, I was left very disappointed.  Boo.  This book had way too many scientific explanations for my taste.  There were too many explanations for Everything here.  Where was the action, relationships, suspense???!  I missed it!  There was a small amount sprinkled in this book, but left much to be desired.  Of course, I hate that Tris gets killed off.  I was not surprised that she went into the weapons room instead of Caleb.  That was just like her.  However, I was already turned off way before that.  Poor Tobias!  I hated reading about him grieving.  I was not surprised to get online & see so many bad reviews of Allegiant. It's truly a disappointment after the exciting previous 2 books!  So, if you haven't bought it yet, don't waste your money.  Just imagine your own continuation of Insurgent!  I guarantee it will be better!!!!V. Gill"}, {"reviewerID": "A2LD9J9DZMB1CL", "asin": "0007373619", "reviewText": "I had read one previous novel by this author &#34;Homecoming&#34;, and thought it mediocre, but this one is a complete dud.  Descriptive to the point of idiocy and repetitive enough to make the reader nauseous,  I gave up halfway through this novel of drivel and will not bother with this writer again."}, {"reviewerID": "A1C6S2CE7DNQBE", "asin": "0007444117", "reviewText": "There is a lot of good in this book. There is also a decent amount of bad.The good: The development of the characters continues here. We see Tobias (Four) start to fall apart a bit under the pressure. He's not dealing well with the world they find outside the wall, or the continued conflict inside it. I know a lot of people don't like this breakdown his character has, how much of a change it is from the other books, but I still feel like it's a definite realistic portrayal of someone being put under that kind of stress. Not many people do well with such things.The world outside the wall is interesting, if a bit cliche in places. The overall plot about why the cities exist is also interesting, though it requires a great deal of suspension of disbelief. Still, none of this bothered me. It's dystopian fiction. Suspension of disbelief comes with the territory.The ending...I commend the author for being so ballsy and making it stick. That's all I'm going to say on that. Love her or hate her or it, it was one heck of an ending and true to the characters. I'm not going to talk about the ending because it really can't be done without spoilers, but I felt it gave us further insight into a lot of the main characters and was very well done.The bad: The switching points of view. Ugh. What on earth made her decide to add this to the final book? I often found myself having to check whose viewpoint I was in, at various points of the book because it was hard to keep straight at times. I really didn't like that. At times things dragged, and it felt like various aspects of the outside were shown just to go 'hey look how bad the bad guys are'. Plans made by the characters felt overly complicated and contrived at times, as well.Overall a worthy end to a very good series. Would have been a solid four stars without the viewpoint switching. As it stands, probably a 3.5 stars for me."}, {"reviewerID": "A1LALF52UHB6TW", "asin": "0006514006", "reviewText": "This book was a very good read for historical fiction. We got heaving bosoms, secret homosexual affairs, and power-grabbing men and women all over the place. But I truly felt like the author slapped down any far-fetched sordid rumor about Anne Bolyen because it made good reading.I toured the Tower of London last month, and the Beefeater who gave the tour said the charges against Anne Boleyn were made up so Henry could marry Jane Seymour. (He did say, however, that the charges against Kathryn Howard were accurate.)Anyway, if you read this book, just take the \"facts\" with a grain of salt."}, {"reviewerID": "A3NTX86CZWCGWU", "asin": "0007444117", "reviewText": "Absolutely loved every moment of this book! It kept me on my edge of my seat and excited. I truly felt like I was the characters and whenever something - good or bad - happened to them I felt their joy and pain. It was truly the most heart wrenching, amazing book and end to a series I've ever read. I wish the series could have continued."}, {"reviewerID": "A1QZV9KGODRBTV", "asin": "0006476155", "reviewText": "This book has it all.  Everything from suspense to thriller to on the edge of your seat action.  This book was hard to put down because the action never stops.  From page to page you never know what will happen next.  I recommend this book to anyone that is into mystery/thriller/non stop action and suspense!!!"}, {"reviewerID": "A1DZKPU7E5R71E", "asin": "0007136838", "reviewText": "Agatha Christie is one of my favorite authors.  I have read all of her books over again several times in my life.  This book really surprised me in the way it worked out.  I would have never guessed!"}, {"reviewerID": "AY15X4NPV16QP", "asin": "0007410956", "reviewText": "A truly amazing story. So well told. Really enjoyed the photos. A most interesting look into the most interesting non-combat story of the war. Easily four stars!An easy four star read!"}, {"reviewerID": "AL1VR14HA1KKR", "asin": "0007124015", "reviewText": "It pretty much is summed up in the title, but I'll add on more.I was raised on this book. It is my favorite literary piece by far. This version is expertly edited and binded. I know quality binding, and this is what you are paying for more than anything. If you are a fan, buy it and love it forever. When you have children and grandchildren, pass it down to them. If you aren't, check it out from the library or buy a cheap paperback that you'll be able to beat up and drop in puddles until it falls apart on your third reading. Either way, you'll get your money's worth."}, {"reviewerID": "A1DSL15SAMW9WK", "asin": "0007169914", "reviewText": "Dr. Seuss' original book is a wonderful, rhythmic book.  That book is suggested for children four to eight years old.  It is NOT the same as the  Bright and Early Board Book which will pull the same reviews here on  Amazon.com as the original book!The board book is an abridged version of  the Dr. Seuss favorite.  It is not a bad book (my son has fun with the  board book which he received as a gift and likes to hear grandma make the  sounds Mr. Brown makes).  However, it is in no way as detailed as the  original (no gum-chewing hippo for example) and the rhythm doesn't quite  &quot;work&quot; in some places (&quot;...He can sound like a bee. Mr Brown  can buzz.  How about you?  Can you buzz? ...&quot;).If I could separate  my reviews I would give the Bright and Early Board book Two Stars and the  Dr. Seuss original Four Stars.  Perhaps if I didn't know that the board  book was abridged I'd give it a higher score, but if you wish to make the  better purchase, I'd suggest you go with the original."}, {"reviewerID": "A28K6QQREM3OTM", "asin": "0007148976", "reviewText": "Five pages into the book I knew I made a mistake.  I plowed through the rest of the book just because I don't like to leave anything unfinished.  I didn't care for the story, or the  writing of the story...."}, {"reviewerID": "A1XHMQPM46LBME", "asin": "0020427859", "reviewText": "This is an interesting and enjoyable read, one I hated to put down until I finished it.  I highly recommend it for anyone who loves mysteries."}, {"reviewerID": "A3L4SJCP3Y2UIL", "asin": "0002007770", "reviewText": "I guess my age (82) allowed me to relate to many aspects of the story.  It was well written and believable,"}, {"reviewerID": "A1N9OA03PECA38", "asin": "0007506236", "reviewText": "What was it like to come of age during the early years of World War II?  Ms. Jackson brings examples of the terror, heartbreak, and the English people's accomplishments to us in this first Churchill's Angels novel.The heart of the story is Daisy Petrie's journey from a shopkeeper's daughter to a highly capable aircraft mechanic, then on to become part of a cadre of women pilots shuttling war planes and military cargo across the UK.  Along the way she becomes friends with a young squadron commander who encourages her toward her goal - actually flying airplanes.The reality of life in the UK during WW II encroaches on all their individual lives with tragic losses of family members, friends, and neighbors to the intense bombing, especially on London and surrounding areas.  Strangers help each other - and become friends.  Romantic opportunities are few and far between.Ms. Jackson's writing is clear and easy to read.  As she introduces her characters, she develops their personalities smoothly through a good blend of dialog and narrative. This microcosm of the indiscriminate brutality of war is made apparent without needing to invoke intense descriptions of blood and gore.This microcosm of the battle of Britain in 1940 and 1941 provides a real insight into a little-known or remembered role of courageous young women in the Battle of Britain."}, {"reviewerID": "ASBAT19GLTRCM", "asin": "0007245823", "reviewText": "loved this descriptions of the vintage clothes throughout the book! the story was better than i expected, with more depth and history. sometimes i got confused about characters, there were a lot."}, {"reviewerID": "ANNO2PVC3OKOJ", "asin": "0007147201", "reviewText": "This is a biography written the way they should be:  recapitulates Pitt The Younger's life, discusses his personality and career (warts and all,  and puts him the context of his time.I learned more about his father (\"the Great Commoner\") in the first two chapters of this book than in a biography of Pitt the Elder that I recently purchased and read.Overall an informative, quick and pleasant read."}, {"reviewerID": "A12WM7X12UAH9Z", "asin": "0028612671", "reviewText": "great book! the amounts are a bit large, so you might want to halve the recipes. Some people have complained about the use of white flour, MSG etc, but a good sub for MSG is a 1/2 tsp of veg boulion. As for white flour - there is organic unbleached flour, and once in a while it won't kill you - substitute whole flour and be peace. Great 'everyday' receipes, which are excellent for cooking for people who are not vegans, or for taking to parties where people are not vegans - that way, you are assured of something to eat and they are turned on that veganism isn't 'brown mushy food'. Anybody who wasn't a vegan from childhood is going to crave old standbys once in a while - mac and cheese, ribs, pizza or the Sunday roast -and they're here."}, {"reviewerID": "A39PXV14KKZWDH", "asin": "0007281447", "reviewText": "I loved the kindle edition of this book. It discusses both the value and pitfalls of competition. Andre allowed us to see inside his soul.  He explained the reasons behinnd many of his actions, both professional and personal."}, {"reviewerID": "A2LW9E5PPXWOHN", "asin": "000766141X", "reviewText": "I like to use this book when my kids are at that stage where they can read really simple consonant-vowel-consonant words - like \"pop, hop, dad, mad, cat\", etc.This is a really great book - it's big enough, that when they've helped me read it, they really feel like they have accomplished something. The rhymes, the funny subject matter, the cute illustrations, all communicate to children.Perfect for kids 4 - 7."}, {"reviewerID": "A1J8CBFEIWRG55", "asin": "0007444117", "reviewText": "I was afraid to purchase this due to all the low ratings. I decided that I was going to read it anyways.  I AM SO GLAD I DID! This is a great story and the ending was better than another book series that was made into movies about vampires. I really LOVE this series read all three books in 1 week thanks to my kids talking me into reading the first. The book was sad however very easy to believe throughout, I think the way it was written was to get you to think about the story and not just muddle through mindlessly."}, {"reviewerID": "A1VB2MAKBKVZHU", "asin": "0007386648", "reviewText": "This is the first book dealing with any war that I have read. I can't believe how much hardship one person endured and lived through. Unbroken is a powerful story that captivated and moved me to tears several times. I believe that I won't ever forget Louie and the other men who served.Highly recommended!"}, {"reviewerID": "AM5YN343GMUCR", "asin": "0002247399", "reviewText": "His books get longer and longer but have less depth, and story. You'll get entire pages dedicated to family members they will never mention again. It's like reading early chapters of the Bible... and Mzdahr, begat Lothar, who begat Hizdahr, whose second uncle was a great man of the fishing provincies and had three brothers named.... WHO CARES!!!!  I find myself skipping entire pages. He does the same thing with descriptions of places, explaining every wall in a room, Ok I get it,flesh out your story. Don't write a movie, including screenplay, and set design all in one. Needs to seriously learn how to edit out the crap or the for the next book I will only be reading the Cliff's Notes version."}, {"reviewerID": "A2OWT7DUH6JOLD", "asin": "0006499945", "reviewText": "It is a great read with justice dominant and love of the family and associates foremost.  Can't put the book down."}, {"reviewerID": "AXRTCLRR8LJA4", "asin": "0007124015", "reviewText": "The story is the same , it is true, but this set is quite nice.It was put together prior (1987)to the release of the current hit movies and has some enchanting dust cover art work.  There aren't any illustrations in the book, other than those painted on the canvas of your mind.  The binding is good and it comes in a solid cardboard box with &quot;middle earth&quot; depictions.This is a nice set and a great gift due to its box and artwork that predates the hollywood images or scenes."}, {"reviewerID": "A1X6EW3MDIXTPW", "asin": "0007386648", "reviewText": "This is a fantastic book!  Being a history nut, not only does this story satisfy that, but it is also a great testiment to the power of human endurance.  So very glad I read it!!"}, {"reviewerID": "A3KTJZAM6SPHQ6", "asin": "0006551807", "reviewText": "Jhumpa Lahiri is a great author. Her depiction of immigrant life in the U.S. compares favorably with her Pulitzer prize winning novel-Interpreter of Maladies. I look forward to reading more of her works,"}, {"reviewerID": "A264GG4X9595PN", "asin": "0007442920", "reviewText": "Listened to the whole series and cannot even begin to describe how much I enjoyed it.  The reader was one of the best yet and I will listen to it again.Have gifted the books and so far everyone feels the same.Will not see the movie, as I liked the visuals from listening to the reader."}, {"reviewerID": "A1NR8MBLKUP5R5", "asin": "0007423632", "reviewText": "I'm not the first one to point out that making an anti-hero work is really difficult; it's a fine line between being disgusted by the actions and hating the character. Lawrence hit on the balance. I still walked away disturbed, perhaps more so at the end than I'd been all along. But Lawrence created all the right circumstances and a world that made Jorg what he is without justifying it, without apologizing for it, and making you think about the potential for the monster in all of us.Chillingly wonderful character development.Combined with an inventive storyline, a fascinating world, and a great pace and cast of supporting characters and you've got a book I read in one day. Just couldn't stop.Bravo."}, {"reviewerID": "A3PFI1VNDYCH5B", "asin": "0007281447", "reviewText": "The love story with him and Steffi is, to me, the best part of the book; it literally got me teared up at one point.  I also like the relationship with him and his trainer, Gil.  I liked his raw approach talking about himself and his life and family.Suprisingly, the part I was least impressed by was his school. It almost ruined the whole book for me.  I admire the guy for doing something good, and helping kids...I just don't get the authoritative approach he takes with kids--forcing them to wear uniforms, and making them recite a speech every day that emphasizes 'respect for authority'...whatever, Andre.  How about teaching kids to question authority and think for themselves?  I'm not a fan of forcing kids to wear uniforms and emphasizing respect for authority.  Those are pretty dangerous values to emphasize, if you ask me.  I don't want to start citing groups in history that emphasize authority and uniforms, but...you know what I'm sayin'?As a teacher of 10 years...and as a kid who was taken advantage of in horrible ways by adults who insisted I 'respect authority', I don't get his ideas...he seems to want to pass on some of the rigid control that his horrible father had on him.I guess Andre didn't learn much from his own childhood.  That's too bad."}, {"reviewerID": "A1HLFAVB77MZRF", "asin": "0007442920", "reviewText": "Let me start of by saying I'm 38 years old and I still enjoyed this book. I read the Divergent after my 13 yr old told me about it, and loved it. If you liked the first novel you will greatly enjoy this one as well. This review will not be terribly long and I won' give away any plot twistWhat I liked most about this book was that it nothing at all like the soapy obnoxious Twilight series my wife and daughter tried to force me to read. I bought kindle version right after reading the original book. The story starts right off where the last book ended.  There are several he plot twist that kept e thoroughly engaged in this book. The pace was outstanding and I felt as if sometimes I just could not will myself to stop reading.What I didn't like or what might be irritating for some is the fact that characters keep dying but other important ones continue to pop up. I don't see the story as realistic but it is a good read regardless. The bottom-line is that if you enjoyed Divergent the you will enjoy this, if not then you shouldn't bother. I loved it and give it 5 stars."}, {"reviewerID": "A21HERJYFEWD1L", "asin": "0007488238", "reviewText": "I thought it was too drawn out in some parts then rushed in others,  I would recommend this to someone who had time to sit & really take note of the characters,  All up I look forward to see how Ms Browm proceeds with the next book"}, {"reviewerID": "A3KSAQBRI7LWCM", "asin": "0007444117", "reviewText": "Thanks to a HIGHLIGHTED spoiler on this site, I knew how it would end. While I appreciate the story, it could have been better. The entire series went down hill somewhere in the middle of Insurgent. Putting aside an ending I didn't necessarily love, and my undying love for the author and the first book, I give this book an HONEST 3.5 stars. It in no way deserves ONE star (because I'm pissed at the ending) and it also doesn't deserve FIVE stars (in order to offset all the one stars and because Divergent was so good). The ratings of this book are a joke. Don't let them sway your or fool you either way. Reality: You need to read it and form an opinion yourself. If you've read the first and second. Give this one a chance. Even if, thanks to unnecessary and annoying spoilers, you know how it's going to end. I really think people need to let this one sink in. The ending sucks, but it wouldn't have been right any other way."}, {"reviewerID": "A3BGVBJ16OJNYA", "asin": "0006514642", "reviewText": "Typically I really enjoy Philippa Gregory's work. However, there have been a few exceptions and this is one of them. If you enjoyed her Wideacre trilogy you will probably like this book. However, if you disliked that trilogy you will dislike this book as there are many similarities in the characters and in the depravity involved in both.  The so-called heroine would be more aptly labelled the villain in both narratives and with just cause. This novel was not about the redemptive power of love or the temptations that face a young woman feeling desire for the first time or even about hard choices when faced with the need for survival. It was about a selfish girl who is never fulfilled or satisfied by her own quest for power and dominance. She has no redemptive qualities and even from the beginning I did not connect to her at all.  Also, aside from the disturbing characters in this story, the horror-like aspects (clay dolls coming to life) were nearly comical and so ill-conceived.  It felt like a Hollywood B-movie horror, with dolls coming to life with Psycho-inspired music dominating the background.  This is no nuance or depth of character, no sincere struggle between doing what you know you should and self-preservation/temptation. Alys throws out a few pithy comments about God abandoning her but it is never convincing and all too obvious that she was always just looking for the easy road in life, caring for nobody but herself. In the end I felt no pity for her, no empathy. And though the ending was abrupt, it was my favorite part of the whole book."}, {"reviewerID": "A2Y3Y1XYP5MYPY", "asin": "0006476155", "reviewText": "LOVE IT! COULDN'T PUT IT DOWN! THE MOVIE IS GOOD TOO, BUT NOT NEARLY AS GOOD AS THE BOOK."}, {"reviewerID": "AS1FAGJNGFBNR", "asin": "0002007770", "reviewText": "I am still reading this book and can hardly put it down to go to bed at night!  I like a book that makes me turn off the TV to read which this one is doing for me.  I can't wait to finish and then watch the movie.  I do recommend this to others."}, {"reviewerID": "A2EQE1JO9X1JDF", "asin": "0002247399", "reviewText": "Well written as usual, the story is breathtaking. However, a bit disappointed that some characters seem to turn around. Arya's part was a bit dull. Yet, I'm looking forward to reading the next one."}, {"reviewerID": "A34L8TXAO1RY4G", "asin": "0007386648", "reviewText": "This is an incredible story, one that is tough to put down.  One of the most impressive things about this work, is the amount of research the author did to accurately tell the story.  With so much of it referenced, a reader can move on to learn more about the history behind the story.I HIGHLY RECOMMEND this book.  Don't hesitate to order it, you will be fascinated."}, {"reviewerID": "A3IE1LEHKSMROF", "asin": "0007189885", "reviewText": "Half of a Yellow Sun was definitely more engaging, but this was another page-turner that brought me in and made me care about the characters.  The dictatorial dad is a bit exaggerated as a caricature I felt, but otherwise this was a very rich compelling portrait of African family life balancing between traditional and modern."}, {"reviewerID": "A3CC24EQUYSGGX", "asin": "0025853503", "reviewText": "The movie came out the year I was born, and being old enough to see it in a theater reshowing years later was a memorable event. So here I am, in my seventies, having seen the movie at least six times, but reading the book only now!  It should be no surprise to discover that the book is so much richer than the film. The depth of the research, the vivid descriptions of the life and times were breathtaking. Someplace online I ran into a list of 100 books one should read in their lifetime and Gone With the Wind was on it.  If it hadn't been for that list, I might never have read this book, and that would be a crime.  It's amazing.  (The casting for the film was good, though I think perhaps the Clark Gable role as Rhett might better be played by a more lecherous and dangerous-seeming actor.)"}, {"reviewerID": "A2BIJQ26TDCZYQ", "asin": "0007124015", "reviewText": "lord of the rings is a great book.It is amazing that someone can make such a good book.When you read it you will travel through the shire,bree,wethertop,rivindell,moria,lorian,raros,rohan,isengard,gondor,shelobs lair,cerith ungol and mordor.Its a great book."}, {"reviewerID": "A6C0B977TSHNN", "asin": "0007157150", "reviewText": "This is a light and entertaining work, with some interesting moral and spiritual insights.  Readers should treat it as science fantasy, not science fiction, for in the modern exploration of Mars, Lewis' description of it as \"Malacandra\" would be untenable.  Nonetheless, as science fantasy it accomplishes being an entertaining and sometimes thought-provoking reading, concerned with the values of religion and philosophy (in Ransom and the Malacandrans) as pitted against a very radical scientific humanism (in the character of Weston and Devine).  Lewis wrote the story with the critique of seemingly \"godless\" scientific views in mind, and his main characters explore not only the dimension of space, but of time, and of human and religious morality as well.  It was not my most favorite book, but many readers will continue to appreciate it."}, {"reviewerID": "A115US2YWWZH87", "asin": "0002726874", "reviewText": "This is an outstanding true story of the Burma war, with none of the malarky that passes for reporting these days. The author does not excuse or whitewash \"Jap\", as he calls him, and does not engage in soul-searching about tactics used to defeat a brutal enemy. When compared to the all-out determination of the entire British (and American) nation to win, the near-treasonous undercutting of their own country since the end of WW II by Liberals of all stripes becomes even more despicable. This is a fine story of the bravery and confusion of war from the foot soldier's point of view."}, {"reviewerID": "AOTPGW9UUR3WC", "asin": "0007479573", "reviewText": "Good read for those individuals that are not astrology aficionado's.  Well written, succinct & to the point.  Would highly recommend to the novice seeking a reading for 2014."}, {"reviewerID": "A3SRW3A5NJY0R2", "asin": "0007444117", "reviewText": "This book was horrible. I own Divergent as a book on my Kindle Fire and I brought Insurgent from a store. I checked out Allegiant from the library because my friend raved about it at school (11th grade) and I hate it.  My real problem is the book doesn't even focuses on the problem at hand just Tris and Four's relationship. And the ending sucked...a lot. :("}, {"reviewerID": "A1N2OIUQBDRNLI", "asin": "0007466064", "reviewText": "Game of Thrones series is one I just could not put down...character study is fantastic and the storyline so engaging it has a cult following all over the world....the entire series is a must read"}, {"reviewerID": "A1R0QX3174QB94", "asin": "0026009102", "reviewText": "The Fountainhead is a must read.  A truly inspiring novel of courage, innovation and a desire to stand up for what you believe in.  Ayn Rand is one of the most remarkable thinkers of the 20th Century.  If you truly want to me moved and inspired I would encourage you to take the time to read this novel."}, {"reviewerID": "A34JOJV93F2RHX", "asin": "0002247399", "reviewText": "I enjoyed the first three books, but in this book the series has become three parts sadism to one part plot advancement. And even that plot advancement has become a Willy Wonka like two steps forward, one step back. Martin has allowed his backstory to swallow the momentum he'd built up so successfully in the early books. The cliffhanger at the end of each chapter has grown stale, and when dead characters don't stay dead, the suspense is muted. Martin likes to tease his readers, bringing major characters in close proximity of one another and then yanking them apart with at best minimal interaction.This has started to feel like a shaggy dog story, and as such, I'm beginning to lose interest."}, {"reviewerID": "AXXASDFBHLG6J", "asin": "0007119267", "reviewText": "For some reason this is one of my favorite Agatha Christie whodunits, perhaps it is because of the brilliant film set in the mediterainian but I love the fact that it is on an island and the landscape plays a role in the action. I enjoyed reading this a bit of a rest after reading the crazy whodunit Bigfoot Littlfoot and West. A good read."}, {"reviewerID": "A1N0JDAXEHD0PZ", "asin": "0007442920", "reviewText": "Not much happens in this book, the second of the series.  I enjoy the idea of it, but it just isn't written well.  I believe, like Divergent, the movie can be better than the book.  That usually is not the case."}, {"reviewerID": "A1CXIBL6U209QJ", "asin": "000725394X", "reviewText": "I liked the continuity with the characters Lackberg established in &#34;Ice Princess&#34;. Lackberg is skilled at building the plot, adding to the suspense and keeping her readers online until the end. Good writer! Good books!"}, {"reviewerID": "A82W45UFPIKX8", "asin": "000727405X", "reviewText": "This book broke my heart but it was a good read.  It was well written and I look forward to more from this author."}, {"reviewerID": "A32SX0A4G21JP4", "asin": "0006479758", "reviewText": "I am a Clancy Fan from the start. have read all of his books, have his computer game etc. I got bogged down on page 308 of 875 and never went back. A good editor could have knocked off 200+ pages easily. It did not have the snap of &quot;Sum of All Fears&quot; or his first two novels. Instead it had  way too many subplots, a fairly ( for Clancy, boring main plot, and too much stuffing in between. If you doubt me, read one of his first two novels, and then big up this behemoth and see if you can finish it! If you have not read his non-fiction books on &quot;Submarine&quot;, &quot;Marine&quot; , &quot;Armored Cav&quot;, and the non-fiction account of Desert Storm, and you are a military junkie, don't miss them! The best book of all is &quot;The Tom Clancy Companion&quot;, trust me..."}, {"reviewerID": "A2TA5NXE0SFG2W", "asin": "000221685X", "reviewText": "The book arrived on time and in good shape. It was clean and looked new. I did not like the read and did not finish. Good will will get this."}, {"reviewerID": "A1AZ5FW80AYD4S", "asin": "0007106246", "reviewText": "Love, love LOVE!  Well, my grandson loves it, and it's a fun book for Grandma's too!  This Duck series has great books - I've purchased them all!"}, {"reviewerID": "A2KIVODZRTGY4U", "asin": "0007182155", "reviewText": "Solo by Rana Dasgupta is a diptych of a novel composed of two related but independent halves.  In the first half, a blind, 100-year-old Bulgarian man named Ulrich reminiscences about his life from the vantage point of his squalid apartment overlooking a train station in Sofia, the Bulgarian town in which Ulrich spent the vast majority of his life.  Though graphically limited, Ulrich's life touches many of the important moments in modern history, beginning with the last years of the Ottoman Empire and continuing through both World Wars, the Nazi and Russian occupations, post-war Communism, and eventually up to contemporary, independent Bulgaria.Ulrich's imaginative life is just as vivid as his actual life, and the second half of Solo is made up of Ulrich's daydreams.  Beginning as a series of distinct stories and characters, Ulrich's daydreams become gradually more intricate and interrelated.  Ulrich's imaginative \"children\" include a young, ambitious Georgian woman and her shiftless brother, a Bulgarian musical prodigy, and an American executive of a record company.  Their stories converge in contemporary New York City, where Ulrich inserts himself as a character in his own daydreams.In lush prose, Solo confronts the consequences of abandoned dreams and explores the relationship between life as it is lived in reality and as it unfolds in the imagination.  Many of Ulrich's creations stretch credulity (How does an elderly, blind Bulgarian man know about the internal politics at an American record company?), but these flights of fancy don't detract from the overall effect.  Ultimately, Solo suggests the life of the mind can be just as soul-sustaining as the life of day-to-day reality:\"Thinking back, [Ulrich] is surprised at the quantity of time he spent in daydreams.  His private fictions have sustained him from one day to the next, even as the world itself has become nonsense.  It never occurred to him to consider that the greatest portion of his spirit might have been poured into this creation.  But it is not a despairing conclusion.  His daydreams were a life's endeavor of sorts, and now, when everything else is cast off, they are still at hand.\""}, {"reviewerID": "A3ROY5Y6DRE4RR", "asin": "0002247399", "reviewText": "A Dance with Dragons is a far more satisfying read than the previous novel, A feast of Crows. It ties up a lot of the loose ends left in Feast and leaves the story in a very exciting place at the end.The focus shifts to Daenaries in the west and to Jon Snow on the wall(two of my favourite characters).It also revisits Arya (I thought the end of Feast of Crows was particularly cruel to her). Strongly recommend."}, {"reviewerID": "A3CSSMSDNW44QV", "asin": "0007442629", "reviewText": "I enjoy all of Cathy's books.  I can hardly put them down.  The loving care the foster mom feels for the kids comes through."}, {"reviewerID": "A196HQV5ETDJHD", "asin": "0007149042", "reviewText": "Abarat was wonderful.  I was hesitant to read it as Clive BArker writes some strong horror and I a not a horror fan.  I was delighted by this book.  While it has strong horror componants and vidid depictions of frightening charaters, it is so beautyfully written that I was able to be totally engaged.  The female protaganist is beleivable as a disgruntaled teenager with the ability to see the world though her own unique lense.  Still she is believable is many of her choices.  She is strong and a heroin but still the child is present.  Many of the other charaters are butual.  The world of the book is very new for me.  It is well concieved and flesed out with great detail.  I am always amazed at a great authors ability to conceive a new world that seems to defy the construct of our world yet creat a space that can in some why make sense dispite being so different.  It is not a book for young teens but 15 and over would do well to enjoy this engaging book.  I have the kindle version which does not have the illustrations.  But when m daughter (long time aArker fan) showed me her illustrated hard copy I was able to pick out the charaters easily.  Thqat is a testement to the vivid nature of his discription.  Never was this story borning and none of the passages laborious.  I am looking forward to reading the next 2 books of the series."}, {"reviewerID": "A3FREJP7S2RXI7", "asin": "0002247399", "reviewText": "Despite the author being an indescribably evil man who feeds on the tears of his fans, the book is great as usual. And best of all, now none of you @#$@# can spoil me on the show since I've already spoiled myself reading the books."}, {"reviewerID": "A2EBTZ4D0GDE6T", "asin": "0007442920", "reviewText": "With all of the great books out there, I'm pretty sad this is the one they're making a movie about. However, since they always screw up the movies, maybe they will actually improve with this one.I hated the characters. I couldn't connect with any of them. Writing was fine, but not my cup of tea (which is surprising because I like almost anything). Felt I had to finish the series, so I read all 3, but I wouldn't recommend them to anyone."}, {"reviewerID": "A11008O7W4C805", "asin": "0007410956", "reviewText": "I enjoyed this book thoroughly.  It was a page-turning adventure of the finest kind.  I hate to fly, so was especially fearful through that part of the book.  Had to keep reading to see what happens next!!"}, {"reviewerID": "A1JSTDGDJU8KHP", "asin": "0007149824", "reviewText": "I found myself rereading favorite passages, turns of phrase and lyrical adjectives, just to enjoy them all the more!  Beautifully written, suspenseful and imaginative."}, {"reviewerID": "A3DE9GQDO6O6D1", "asin": "0027888304", "reviewText": "In The Moon Lady, Amy Tan author of The Joy Luck Club and The Bonesetter's Daughter, presents a small tale for young children which adults will also enjoy.  Focusing on a story set in China, Tan brings her wealth of knowledge about China and its folktales as well as her love for this country and its traditions. In addition, the illustrations by Gretchen Schields add a wonderful dimension to the story since readers can also visualize the tale by viewing these pictures.On a rainy day as grandchildren whine that they can't play outside their grandmother tells them a tale based on her own experiences as a child.  Using this method Tan provides an allegorical tale concerning children and their wishes.  Telling the children of her wishes as a young girl, Ying Ying tells the children a story about her own wishes at the times of the Moon Festival.  And as all folk tales provide, Tan is adept at providing her readers with an adventurous tale compete with the mysterious Moon Lady and a moral to the story.This is a good book for young children who cannot only learn about the Chinese culture but the saying \"Be careful what you wish for.\"  I also recommend this book at any age since it is also important to remember this as we move on in life."}, {"reviewerID": "A1UF01I9WHUF61", "asin": "0028610105", "reviewText": "4 1/2 stars. I've had this book over 10 years. The same year I got this book, someone else had given me \"The New Basics\", which I rarely pick up. Bittman's book is by far the more accessible book for home cooks who don't want gourmet fancy, but want something more than the Betty Crocker cookbook (which I also have). There have been so many times when I searched out recipes for something on the internet only to suddenly think to look in this cookbook and find an exact, simple recipe for what I want. The section on vegetables is great. So many cookbooks give directions as \"cook until done\". Is that 5 minutes or an hour? This book gives a lot of information about what \"done\" means and how long you should expect it to take.Over the years I've found a couple things that didn't work; could be an editorial problem. I have a few notes on the pages of some ingredients changes I've made. One that comes to mind is the Chicken Adobo; it calls for a whole cup of soy sauce, which I found overwhelmingly way too salty. The other issue, as some other reviews pointed out, is that the binding has fallen apart. I'm about to duct tape it together, but it doesn't affect the quality of the recipes. Overall, I highly recommend it."}, {"reviewerID": "A1WFMDH843L20C", "asin": "0007157177", "reviewText": "This is a fascinating book and story that must be read all the way through book three in the series to be truly understood. Once I realized what it was truly about, it became much easier to wade through the diversions that are set up with too much going on about minute details and the thoughts of the characters.  More action would have pleased me but I guess I am just accustomed to the masters of those kinds of books.One needs to remember that it was written so long ago that the prose is, to me, cumbersome and Lewis goes on and on about things philosophizing at great length about the smallest issue. I felt I had to stick with it in spite of this because by the time I began to see this, I had already invested too much time in the reading of it.I enjoyed this last book in the series more than the first two."}, {"reviewerID": "AU4YLF8VKEFBK", "asin": "0007124015", "reviewText": "This is without a doubt the best book I've read ever, and really, it is outstanding. It has a style and a world that has been thought of to great length - giving it backgroud and atmosphere. Also you can tell that it took  Tolkien years to write this massive book in the way it changes style after  one third of the first book. It's about good versus evil in pure form, and  it has a nice heroic air. Some might find it too long - some even boring,  but I myself think it's a marvelous time in a world I wouldn't mind being  in."}, {"reviewerID": "A32D1Y2M5QWENX", "asin": "0007442629", "reviewText": "This book just proves to us that life is so very short and we should treasure each day we are given as Patrick did. It was unfair that he was taken so young but in many ways so blessed to have so many good people that loved him and his son Michael dearly. Blessed to have had Cathy and her family , and to fall in love again before the angels came. Some ppl are not so lucky to find true love at all let alone twice in a lifetime. First with his beloved wife waiting in heaven for him and then again with Cathy.  My heart went out to everyone in this story and I cried with them as I read thru the pages. God hasanother Angel in heaven to watch over us. Thank you Cathy for sharing yet another amazing part of your life with us."}, {"reviewerID": "A3QQRNNUUPV8F8", "asin": "0007442920", "reviewText": "Great book with lots of twists and turns and makes you not want to put it down!  Must read for everyone!"}, {"reviewerID": "A291ZW0VWGH03U", "asin": "0007386648", "reviewText": "Couldnt put this book down, though I did have to skip some the gut wrenching passages. It is simply unimaginable that our POW's were subjected to both physically and mentally. And their families too - not knowing if they were alive or not, waiting years to find out. Louis Zamperini is a true hero.  This book renews my appreciation for those who fought for our country. Bless them."}, {"reviewerID": "A3VPCMAW4WY51J", "asin": "0025853503", "reviewText": "Read it first when I was 14 y.o. Still remember how I was bawling that Scarlett couldn't see how wonderful Rhett was and how much he loved her! :)Ah, one of the best books I've ever read!"}, {"reviewerID": "A1JQJSWDRZMFU8", "asin": "0007118899", "reviewText": "TATIANA & ALEXANDER, the sequel to THE BRONZE HORSEMAN was a very emotional story compared to the first novel. This is one to have a box of tissues by your side. The ending left me breathless. The author knocked the breath right out of me with this series, and they are all on my keeper shelf where they will stay so I can re-read them. I can't recommend them highly enough."}, {"reviewerID": "A2S1OOYRQUBRVX", "asin": "0007167040", "reviewText": "I WASN'T interested in horses before, or horse racing, but I still really enjoyed this book.  A real page turner, excellently written."}, {"reviewerID": "A199GQVOZ6XJC9", "asin": "0007194161", "reviewText": "This is one of my all-time favorite books.  Found CC via Palahniuk.  He is a very unique voice, and I hope we'll see many more books from him.  Stick with it Craig, you are a brilliant man, and an extremely talented writer.  You've inspired me, and touched me with your writing.  Kudos, bro."}, {"reviewerID": "ANCF35O89BHE7", "asin": "0007442920", "reviewText": "I really enjoyed the first book and was afraid I would be disappointed with the second. I was not. On to book three!"}, {"reviewerID": "A1J7RUKG9VB8SI", "asin": "0028604199", "reviewText": "wonderful and funny--loved it.  Took it to dinner with friends and we could not stop laughing.  We need more, more."}, {"reviewerID": "AW0DSWKGR7POZ", "asin": "0002007770", "reviewText": "I loved this book.  The author really wrote this book in a different way.  A 93 year old in a home in one chapter then the next it is about himself as a young man.  Then back to the nursing home and back to the young man's life.  I could not put the book down.  I hope I can find more books written as well as this one."}, {"reviewerID": "A2RA98L9KYYWXS", "asin": "0007111509", "reviewText": "Quite the Agatha Christie style. A few stories dull but none the less a good read. Story of swapped bags was a big score."}, {"reviewerID": "AZRCDV1K3AY1I", "asin": "0006492460", "reviewText": "This is a wonderful book for anyone who attended elementary school in the 1940's and 1950's.  Memories of reading about Dick, Jane, Baby Sally, Spot, Puff, and Tim will quickly return to the reader.  This book also tells what was going on in our world during the time that the Scott Foresman reading series was so prominent in our schools.  The introduction of the book was written by Bob Keeshan, our beloved Captain Kangaroo.  I actually bought my personal copy of this book several years ago and purchased this one from Amazon for a dear friend who is a retired librarian.  She was fascinated by her reading.  She would tell me every day what decade of Dick, Jane, and Sally that she had just read.  This book covers the time period from 1930 through 1960.  This book could be called a \"keeper.\" Those growing up with Dick, Jane,and Sally will want to keep it forever and read it over from time to time."}, {"reviewerID": "A1DB5KN5U63DZ", "asin": "0007386648", "reviewText": "I thought I was buying a novel (well, the jacket called it a \"story\").  But it was much better.  Sure, the author got hold of a great \"story\", but then she did great sleuthwork to present factual information and illuminating insights.  The emotionality was thrilling and gripping.  I cried openly at several spots.  And the author provided some of the best quiet descriptions of a mother's love I have read in years.  Enjoy it at Christmastime!"}, {"reviewerID": "ATUTL776OYKAK", "asin": "0007447868", "reviewText": "Well I like the deries on the tube.  I thought having seen them it would help.  It did kind of.  This is a hard read at least for me.  The name are not  easyto read...I would reccommend starting form the beginning of the series, there is a lot that you miss.  But over all I think it is really good.  I will finish it though."}, {"reviewerID": "AVGJ0CDDOKHV", "asin": "0007189885", "reviewText": "I listened to an NPR interview of Adichie and immediately wanted to read one of her books. I chose the first one, Purple Hibiscus. She took me to Africa and the communities where her characters lived. Beautiful writing, beautiful book."}, {"reviewerID": "A2HYM27D4GRYQ1", "asin": "0007442920", "reviewText": "This was a great book and it made my imagination go wild. I cannot wait for the movie and 3rd book."}, {"reviewerID": "A37KOTT708PKUE", "asin": "0007256817", "reviewText": "Wow. This book was very hard to read at first with all the punishment that Vanessa had to endure. Why a mother would do anything that Vanessa had to go through is beyond me. Seems like there was always a new punishment Vanessa had to face whenever her mother felt like it.All's I have to say us what a gut wrenching story."}, {"reviewerID": "ADN9KMS7283WS", "asin": "0007124015", "reviewText": "Love this book now on to the last one  return of the king here I come so pumped to read"}, {"reviewerID": "A17KNKH43ZJ4XR", "asin": "0002247399", "reviewText": "Great book would highly recommend the whole series every character I like has died but it makes for good reading"}, {"reviewerID": "A1D14PTLE1SUYF", "asin": "0007161263", "reviewText": "I read this book with my 15 year old son.  We saw a review of it in the Washington Post newspaper and we fully agree that this is a great read.  I recommend it to anyone interested in finding out more about James Holman, the Blind Traveler.  We felt as if we really knew him by the end of the book.  The author does a terrific job of taking the reader along on Holman's adventures.  It reads like part travelogue, part mystery, part biography, part history of the time period.  I wish I could have met Mr. Holman.  What an inspiration !"}, {"reviewerID": "AI5OR1HSYXCCL", "asin": "0026045702", "reviewText": "A great resource , even in the computer age.  Should be the foundation of any cookbook collection, from the bachelor with two cookbooks to an entire shelf of books. I do not agree with all of the changes over the years but it still stands aloneA great gift for a young person moving into their first place.Highly recommended"}, {"reviewerID": "A2LU06DI6E6KTG", "asin": "0007169914", "reviewText": "I read this book to my son and wanted to continue the tradition with my grandson. Such a darling book. My little munchkin just loves it!"}, {"reviewerID": "ATFY9YPPKZZBS", "asin": "0002247399", "reviewText": "It arrived in excellent condition.I give it a 5 because it looks durable and arrived in such a mint condiiton.i am very pleased with the product and would recommend others to buy it."}, {"reviewerID": "A2SSFQ909VZMTI", "asin": "000649692X", "reviewText": "If you are an introspective person, I believe you will love this book.  I'm reminded of the saying that goes something like 'the way things are changes with the way you look at them.'  I'm a long  time fan of Susan Howatch as a writer.  This is the second in her Church of England series.As I grow older, I find myself trying to solve some of the mysteries of life and relationships.  This book helped me.  Don't misunderstand, this is a novel with a great plot, but also delves into personalities and faith and family relationships.  I read this about a month ago and still think about it often.  Obviously, I recommend it highly."}, {"reviewerID": "A3UMZ97GSIPYY3", "asin": "0007149824", "reviewText": "I throughly enjoyed the book.  It started out a bit slow, but I got sucked in pretty quickly.  I would describe it as an often dark, sometimes funny, thoroughly entertaining mystery novel.  And I liked the chess angle, too.I'm a bit confused by all the complaints about the Yiddish-isms.  I'm not Jewish.  I don't speak a word of Yiddish.  And, frankly, I'm not all that familiar with the Jewish culture.  But I had no problem understanding the Yiddish-isms in their context."}, {"reviewerID": "A1AFNT57IIT0NZ", "asin": "0007386648", "reviewText": "This was the kind of book that was hard to put down once I started. It also gave an excellent, balanced account of imprisonment during the war, as well as the PTSD that followed - and the unusual choices that brought him out of his post war trauma.  Thanks to Laura for an honest, well written story."}, {"reviewerID": "A3E8QNDC7CV44", "asin": "0007157150", "reviewText": "Elwin Ransom, an Oxford don and an ardent philologist, is enjoying a solitary cross country ramble on his vacation when he encounters Professor Devine, a long-time acquaintance from his student days at Oxford, and Weston, a somewhat distracted and grumpy, reclusive individual. Weston is, in fact, a physicist who has secretly built a space craft in which he and Devine plan to return to Mars (Malacandra, in the native Martian populace's language) with nefarious ideas of plunder and planetary domination. As part of their plan, they drug and kidnap Ransom to take him along as a sacrificial peace offering to the native population.On the face of it, a beautifully written Out of the Silent Planet has a simple classic sci-fi plot and can certainly be enjoyed at this level. But virtually every reader will recognize that Lewis' work probes far more deeply than that. His strongly held Christian beliefs, never far from that surface plot, are apparent in his criticism of human prejudice and greed. It is also clear that he holds extremely strong views against notions of eugenics and the then universally held belief in the natural supremacy of western white civilization as compared, for example, to aboriginal populations elsewhere in the world. Even though his allegorical tale goes so far as to include a version of angels and an archangel, the story never becomes preachy, odious or whiny.Astute long-time readers of science fiction are always on the alert for errors of scientific fact. So Lewis may be mildly criticized for making a fundamental error in how gravity would work aboard a space craft but this certainly detracts in no way from the quality of his story. To the contrary, I thought he earned top marks and high praise for crafting, for example, a startlingly accurate description of the appearance of the sky in the transition zone from atmosphere to space at extremely high altitudes (at a time, of course, when space travel was at best a twinkle in scientists' eyes). I also noted a single quite astonishing comment that seemed to predict Einstein's work on cosmology, travel at light speed and relativity ... \"But if the movement were faster still ... in the end, the moving thing would be in all places at once.\" His brief exposition on linguistics and the possibility of a universal syntactical structure of languages was also fascinating without being distracting or pedantic.For fans of soft sci-fi, Out of the Silent Planet will provide a smorgasbord of delights - alien characters and personalities, philosophy, ethics, survival in a potentially hostile environment and descriptions of alien flora and fauna that are near poetic in their beauty and majesty. I'm looking forward to reading the next novels in his masterwork trilogy, \"Voyage to Venus\" and \"That Hideous Strength\".Highly recommended.Paul Weiss"}, {"reviewerID": "AOVPYW3UODXQ2", "asin": "0007386648", "reviewText": "I am at a loss to say something that has not already been said about this amazing book and the hero, Louis Zamperini, whose incredible story it tells.As the WWII generation passes on, it is important for all Americans to pause and remember the sacrifices they made... and to ponder what is asked of us today to be worthy of their legacy."}, {"reviewerID": "AII2CYHIJ0PP6", "asin": "0025853503", "reviewText": "GWTW is, hands down, the greatest American novel.  In my opinion, it is the greatest novel ever written.  When I first read GWTW, I couldn't wait to get to the parts about Scarlett and Rhett.  Now, though I still love the interplay between them, I read it for the incredible detail to history.  Margaret Mitchell grew up sitting on the knees of old confederate soldiers while they reminisced about the war, then took that treasure and masterfully provided a moving account of the war and it's aftermath through the eyes of Scarlett O'Hara.  The wonderful thing is that she is able to give this history lesson all wrapped up in the greatest love story of all times!  All the characters are memorable - Mammy, Gerald O'Hara, Ashley, Melanie, not to mention the near-perfect man, Rhett Butler! And then there is Scarlett... While many people who have only seen the movie don't like Scarlett, no one who reads the book can help but admire her sheer determination to overcome the tragedy of the war and rebuild her life.  At the same time, it is heart wrenching to see her throwing away the love of her true soul mate and ruining her life because of the fears the war sprouted in her.  I admire Scarlett on many levels, and think she is the most vivid heroine in literature because of her failings and her strength. If you could capture Scarlett's fire and Melanie's kindness and roll them into one woman, she could rule the world and be adored by all. If you want a book that will grab your heart and capture your emotions, you must read Gone With The Wind!"}, {"reviewerID": "AVBK68931HD11", "asin": "0002247399", "reviewText": "A Dance with Dragons if the fifth book in The Song of Ice and Fire series (after A Game of Thrones, A Clash of Kings, A Storm of Crows and a Feast for Crows and before, The Winds of Winter (forthcoming) and A Dream of Spring (forthcoming)).The beginning of this volume is chronologically parallel to A Feast for Crows and focuses on the other half of characters, on events in the North of Westeros and beyond the Narrow Sea.Tyrion's part starts in Pentos, where he will be embarked on an unusual adventure to Volantis and Mereen.In the East, both Quentyn Martell, Victarion Greyjoy are on their way to Mereen to ask Dnerys's hand in marriage, while she tries to conciliate dragons, husband, lover and peace for her people.At the Wall, Jon is trying to cozy up to Stannis and the Red Priestess Melisandre, to ensure their help in the defense against the Others.Beyond it, Bran is searching the three-eyed crow with Hodor, Meera and Jojen Reed, and Summer.In the last quarter of the book, characters from A Feast for Crows rejoin the cast as timeframes are once again synchronized.It took me over six months to finish this heavy volume! And even though I'm very glad to finally be done with it, one particular event in the last chapters came as a great shock and now I can't wait to read The Winds of Winter (whenever it comes out)."}, {"reviewerID": "A16JTNAEKD139I", "asin": "0007157169", "reviewText": "You can read the other reviews for a plot summary. Let me add that I've read this great novel many times and do not see it as an allegory. From Lewis's other works and letters, I think it's clear that he meant this to be a \"what if?\" series. What if space travel is possible--what will we find out there? His answer is that earth (the Silent Planet) is separated from the rest of the universe by sin. What if someone from earth goes to Venus, a planet that knows no sin? What if Satan (the bent angel) tries to achieve what he achieved on earth--the seduction of the planet's residents? How would this all play out?If Lewis had wanted to write an allegory, he could've done that: see \"The Pilgrim's Regress\". Instead he wrote an engaging, exciting story of good vs. evil--happening all over again."}, {"reviewerID": "AIQ996EEP7MN8", "asin": "0025853503", "reviewText": "always a good read. where are the Rhett Butlers today? what a man, what a story, What a must have in your library."}, {"reviewerID": "A2YGB747HQLREO", "asin": "0028631528", "reviewText": "great information at hand and likely the most thorough book on fish i've found.  sure wish it had pictures, but i knew going in it didn't.  would still recommend!"}, {"reviewerID": "A23GFTVIETX7DS", "asin": "0006551807", "reviewText": "In THE NAMESAKE, Pulitzer Prize winning author Jhumpa Lahiri's first novel, the characters are always hungry:  for a place to call home, for family, for love, and, of course, for food.  Ashima, in an arranged marriage to Ashoke Ganguli, misses her native India as she sets up house far from her family in Massachusetts, a land of bleak winters that her family will never know, much less understand.  Making Bengali food out of American substitutes, she searches desperately for the comfort of her childhood.  Time gradually pulls her away from the past, and she learns the ways of America, becomes friends with other transplanted Bengalis, and begins a family.  A quiet affection develops between Ashima and Ashoke as they raise their two children, oddly-named Gogol and his sister Sonia.  The novel lovingly follows the family through decades of heartache and celebrations.Gogol is the novel's center and its primary perspective, the namesake of the title.  Although he does not know it until much later in life, Gogol is named after the Russian author not because, as he is told at first, Gogol is his father's favorite writer but because a copy of Gogol's short stories saved Ashoke's life after a train wreck.  To Ashoke, the name of Gogol signifies a beginning, survival, \"everything that followed\" the horrific night spent in the rubble.  This idea is the heart of the novel; as immigrants the Gangulis must look forward to what lies ahead instead of what is past.  In America, Ashima and Ashoke are reborn, just as their children must find their own paths.Rich with detail and infused with affection, this novel has a lyricism that brings the Gangulis' world to life without exoticism.  The description of food - Indian, French, American - is so exactly decadent that one should not read this book hungry.  The only thing this wonderful novel suffers from is a neatly-wrapped nostalgia in the final chapter.  Despite this minor flaw, I highly recommend this novel for a wide readership.  Only those who desire strongly plotted fiction should be disappointed.  (4.5 stars)"}, {"reviewerID": "AAQDMBUPTJAIQ", "asin": "0002007770", "reviewText": "I couldn't put this down.  A wonderful story, with rich authentic detail."}, {"reviewerID": "AGX9T5YU45I22", "asin": "0025225804", "reviewText": "I needed a good Latin dictionary for my level, which is beginner level and it does the job. The layout is nice and clean and easy to use. I suppose even the advanced level student should find this useful. Since it's not a modern language, the vocabulary is limited. Don't try to compare it with English."}, {"reviewerID": "A1U8DHSI18EEJ1", "asin": "002044995X", "reviewText": "\"Here one sees the extent of the corruption of American ideals that has taken place in the name of fighting communism. No one, it seems, not even Adolf Eichman's personal staff, was too tainted to be rejected by the CIA's recruiters, at least as long as his relationship with the U.S. government could be kept secret.\"The American people deserve better from their government. There is nothing to be gained by permitting U.S. intelligence agencies to continue to conceal the true scope of their association with Nazi criminals in the wake of World War II. The files must be opened; the record must be set right.\"This book was published in 1988 and since then the files have been opened and then closed and opened and closed again. The battle goes on.If you are one of those folks who have dismissed the secreting of Nazis into the U.S after World War II because you thought that they were all \"innocent\" scientists whose knowledge was crucial to our survival, you have a lot to learn. And you will learn a lot of it in this book.I picked up this book for a dime at some flea market or yard sale many years ago. I read it but still didn't believe it. Since that time, I have taken up the project of determining \"Who Financed Adolf Hitler\" and why. This book deals with the \"why\" in the above question.I hate to say it but this is a book on the treasonable acts of some top people in the American government and business community.I have already gone through this book and highlighted the chapters. It is on my list for synopsizing. I do this task because I want to more deeply ingrain the facts of this book into my memory. My attempt is to make books like this one more a part of my readily available accessible knowledge. I want to know what it says and I want to remember what is says. This business is too important to simply file in the back bedroom of my cognizant being. I want to study this, know it and understand it all - if I can. At the moment I am working on the same project with two other books, so this book will have to sit on the shelf for awhile.I suppose one would classify this as a cold war book. But I considered it a World War II history book. This is the kind of book that will help you to understand why there was a World War II - and a World War I for that matter and a World War III - if it is in the making.More and more of us Americans must learn this information. We have to know it and understand it so that we can get over it in the future and hopefully never let this type of thinking and attitude lead us back to wars of this nature ever again.At the moment we seem to be losing this battle.Richard Edward Noble - The Hobo Philosopher - author of:\"America on Strike\" A Survey of Labor Strikes in America."}, {"reviewerID": "AJDD13W7UQ6LN", "asin": "0027136701", "reviewText": "This story takes place in 1864, on the Wisconsin frontier.The book follows the adventures of a certain girl, named Caddie Woodlawn. She is a tomboy, who likes to run around wildly with her two brothers, rather than staying inside and doing the tasks that are expected of her, like sewing, knitting, and cooking, with her mother and her older sister, Clara.Living in territory where Indians are nearby, excitement is always brewing. There are fish to catch, rafts to paddle, fields to plow, and school lessons to learn.Caddie's adventures were loosely based on the author's own grandmother. I think that makes the book interesting, to know that some of the events actually happened, and that the characters were based on real people.I recommend this book for either boys or girls. I think it was quite a fun read, and good for any age."}, {"reviewerID": "A1KFE55P7RG78P", "asin": "0006550436", "reviewText": "I really liked this novel, although the beginning was a little slow and I felt like it wasn't going anywhere.  I got into it when Ruth started telling her history, and then I really got into it when we were learning about LuLing's history.  I've read all of Amy Tan's books and this one is probably my second favorite (after the Joy Luck Club)."}, {"reviewerID": "A1GYU1H22N277X", "asin": "000616823X", "reviewText": "I hadn't read an Agatha Christie book is a while, and this is different that many of her others. Something about this book reminded me of  Patricia Highsmith novels. It's an interesting book, with an interesting ending. Put aside your expectations of how an Agatha Christie book will go and enjoy it!"}, {"reviewerID": "A6HKMRQH8V5LQ", "asin": "0007236360", "reviewText": "This book was really good, but i had to take several breaks from reading it because it was so sad. Also not a good selling point for people thinking of foster care. Although it's a true story, I was wishing for a much happier ending"}, {"reviewerID": "AZVWKJGRNX6R0", "asin": "0007441290", "reviewText": "It was choppy, bad grammar, too many details of unimportant material. I struggled to read it. It just goes to show that with a big name and publicist you can get away with  pure crap."}, {"reviewerID": "A1KSGRU2PERWUC", "asin": "0007420765", "reviewText": "I seem to be reading a lot of current Nordic lit lately.  This book pales in comparison to writers like Nesbo and Larsson.  In this book, there are 20 major characters.  I didn't care about a single one.  They seemed one dimensional and I just could not connect with them.  Each of the characters brought so much baggage with them, that I felt depressed.  A young computer programmer with Asbergers, a new mother who nursed too much, a doctor estranged from his father, a mother in law in the middle of a blood feud with her neighbor, a spoiled rich girl who hates her blue collar husband and her children, a preacher wannabe, an abused wife.  The list goes on and on. The writing style (or perhaps the translation) was also lacking.  I could not find anything redeeming enough to recommend this and wound up scanning the last third just to see \"who dunnit\".You might try one of the two authors mentioned above for a completely different (and I think better) take on Nordic mysteries."}, {"reviewerID": "A1VPY02MAJPJSN", "asin": "0007386648", "reviewText": "Unbroken is a fascinating, true story of courage and perseverance (and some luck!) Louis Zamperini, an Olympic runner and determined young man, is shot down over the Pacific during the early days of WWII. He and a buddy survive incredible ordeals at sea and then at the hands of the Japanese who take them prisoner. Not a pleasant read but an addictive one; I couldn't put it aside for long and have recommended to everyone I know who hasn't already read it."}, {"reviewerID": "APXQHFTTYERDE", "asin": "0002007770", "reviewText": "Difficult to put down, the story stayed with me even after the book was closed. The basic string of the plot: a young man, Jacob,  so overcome with grief that he runs away with the circus.  Sounds like a cliche, right? Yet Gruen creates a rich world full of gritty people with lives that figuratively walk a tight rope.  The traveling circus was a roller coaster of success and disappointment - Gruen brings to light the many fascinating facets of this unusual lifestyle.Cliches abound and the plot a little predictable, but it did not distract from the interesting tale.  I would have liked to have seen a little more depth form the main characters. And there were a few unbelievable aspects - leaving an Ivy League education in the final hours, knowing what their family sacrificed to provide it,  just to try and forget their grief?  It would have been very disrespectful and irresponsible to do so.  But, without this selfish act the story would not have moved forward... My favorite aspect was the animals.  I cringed at the cruelty, which I am sure was common place for circuses, but was uplifted by the triumphant pachyderm. Even the common dog was spotlight worthy. Overall, a well told tale about grief and  love wrapped up in a childhood fantasy."}, {"reviewerID": "AZULU4TOTOLEU", "asin": "0007444117", "reviewText": "The third and final book in the Divergent series....and what an ending it is. Let's just say that I cried like a baby, and that it was nothing like the semi &#34;happily ever after&#34; ending of the Hunger Games series. Throughout this book, it was sometimes difficult to tell the &#34;good guys&#34; from the &#34;bad guys.&#34; Just when I thought I had it figured out, someone would do/say something that proved me wrong!"}, {"reviewerID": "A3UWVXZ998DULX", "asin": "0007124015", "reviewText": "As others have said before me, this is a truly inspired work.  Rather than reiterate  the 400 previous posts, I'll just say this is a book the will create a  thirst for reading in a child.  I would strongly suggest reading  the Hobbit to your young ones, and then letting them read the rest of the  series on their own.  These are the only books I have read more than twice  and it certainly got me away from just reading comic books.  Enjoy!"}, {"reviewerID": "A1Q0C3R3DM6GP2", "asin": "0007550197", "reviewText": "I enjoyed this book so much.  It was a lovely read.  It had great emotion, a slice of true friendship, and love.  Just the kind of story you might want to read on a rainy day.  Enjoy!!"}, {"reviewerID": "A2DO8HH8GBK76E", "asin": "0007124015", "reviewText": "I have loved Tolkien from  the time I was 12 years of age and now I am 30. The hobbit was my first introduction to the world of middle earth, both in book and the 1970s cartoon (it's goofy but as a kid I loved it) I love the messages of heart behind all of these books, of bravery in the midst of really extreme darkness. Timeless themes which is why I believe it's captivated generations of readers. Great books, great series, this reader highly recommends."}, {"reviewerID": "A1I1QTHWIUZPP6", "asin": "0007491263", "reviewText": "Being starved of the real thing, I read this on the strength of George RR Martin's recommendation and was disappointed by the lack a plot and development of the characters."}, {"reviewerID": "A1BYZPTC3ABWAE", "asin": "0007436564", "reviewText": "The methodology used by the foster family in this book is being used in classrooms for emotionally disabled children in the U.S. with some success.The boy's back story is profoundly disturbing and sad, but the love and courage of this famly shine through.As a side note, it made me furious to see that the same systematic preference for the most awful parents is present in the UK even as it is here in the US.  I can't help but wonder what a different outcome there would be in cases like this if the parental \"rights\" were terminated more quickly once it were apparent that the \"parent\" lacks even the most basic desire to provide and protect for the child.If you work in the foster system or with emotionally disabled kids, this book may be very helpful for you."}, {"reviewerID": "A21IQGTMHVM3XG", "asin": "0007158505", "reviewText": "&quot;What was I scared of?&quot;, the last story in this book, has long been my favorite Dr. Seuss story.  I read it aloud as a child.  Now it is one of my son's favorites.  Dr. Seuss explores scary things like the dark, people or things that aren't familiar, and the idea that it doesn't work to try and run or hide, all within a silly story of green pants with nobody inside them.  The sneetches and their struggle to be elite makes any number of statements about our society in a way that is simple for young minds to understand.  And the stories about the stubborn Zax and the mother who named all her sons Dave turn words into an amusement park.  Definitely one of Dr. Seuss' best."}, {"reviewerID": "A18Q30QKLGFGNU", "asin": "0006511252", "reviewText": "Thank goodness for Harry Flashman. If not for this man's self-depreciating, lurid, immoral, wanderings through psuedo-prim &amp; proper &quot;Victorian England&quot;, I might have believed the &quot;Howard's End&quot; version of that era. Harry proves that we as a race are merely inches ahead of wild boar in the evolution. Quite frankly &quot;Flashy&quot; makes James Bond seem like a prig."}, {"reviewerID": "AEJ9C7IWO3SZ0", "asin": "0007386648", "reviewText": "What an amazing story!  Thank you Louie for your service to our country, and for your unbendable spirit!  Like the saying goes, truth is stranger than fiction.  What Louie went through, Hollywood would never be able to dream up!  So wonder they are making a movie about this! I appreciated Louie showing us his up close thoughts and actions as his mischief as a boy, helped him later as he pushed to become an Olympian, a bombardier, and a POW during World War II, suffering through some amazing atrocities and still remained UNBROKEN."}, {"reviewerID": "AJQ1S39GZBKUG", "asin": "0020519001", "reviewText": "When I was in college, I took writing classes. In my group there was a girl who used to write very long clauses, with many whos, wheres, thats... One day, a Professor suggested her to read Hemingway paying atention to how he wrote sentences so short and at the same time so complete, with many information. So, everytime I  read Hemingway, I bear this in my mind! He always gets me over! And it's very efficient. Short sentences aren't tiring or boring. I think that is one of the reasons I like and admire his work.When it comes to A Farewell to Arms, readers complain about a lack of character development - mainly before the war- and psychological analysis. And I agree. There isn't much of it through the narrative, but it seems to me this is not an accidental omission. My feeling is that the writer wanted to show us when you are at War - as the characters - it doesn't matter where you come from, what you've done, or what are your preferences. You are only one more soldier (or nurse, as he also portraits). And that's why we barely know what happen to them before the war had broken out.I liked the book both as a love story and as a war novel. The love affair between the soldier and the nurse is very touching. And it kept me rooting for them all the time. The end of the novel got me down."}, {"reviewerID": "AMS383P9S58WB", "asin": "0007386648", "reviewText": "I'm a high school student who loves to read non-fiction. I never have heard of Louise Zamperini's inspirational true story. This book is a have to read book. Laura Hillenbrand writes in true facts, doesn't hollywoodized the story its realistically written, and hooks you to the story. I have re-read this book numerous times. Laura Hillenbrand does really well of explaining how this amazing man showed us we can make it through our obstacles we just have to beieve we can. Thanks Louise Zamperini and Laura Hillenbrand."}, {"reviewerID": "A157GF69NHAC2H", "asin": "0002247399", "reviewText": "I'm not sure what happened here. I can only guess that Martin has lost interest in this, and is dragging himself through the pages on the whipping insistence of his editor.There are flashes of what I enjoyed in the first three books, but those flashes are quickly snuffed by pages and pages of monotonous slush. Not even Tyrion can save this one.I've learned a lesson here. If you start a series, tell your story, and finish it promptly. Don't do... this.King did the same thing with The Dark Towers series. Fool me once..."}, {"reviewerID": "A27Y2R925LLIE7", "asin": "0006178979", "reviewText": "If you are interested in the kings and queens of England over the years, this is a delightful and very informative book.  The characters remain true throughout and the book, although fiction has been well researched.  You will enjoy it -"}, {"reviewerID": "A1Z2NM3TWLNUIV", "asin": "0007444117", "reviewText": "dont read it and dont buy it! the ending is horrible!i would not spend money to read this dissappointment at all...spolier following............ tris dies...."}, {"reviewerID": "A3ULJLKJPX81GZ", "asin": "0007303017", "reviewText": "Great story of perseverance and love. Our life has been filled with great dogs who have touched our family's hearts."}, {"reviewerID": "AKBEJ73OW1N1J", "asin": "0002247399", "reviewText": "Sure, it's frustrating to wait six years for a book to come out, especially if during those six years one builds it up in one's mind to be the greatest book ever.  But let's face it.  Martin is as good as it gets.  Most of the perceived flaws of this book were things we all liked in the early volumes:  complicated setups and fully realized minor (as well as major) characters, unexpected plot twists, favorite characters being killed off, large chunks of real-medieval setting (and traveling).  (Remember, Arya spent much of \"A Storm of Swords\" wandering up and down the riverlands.)  Those who give this book one star are comparing it not to other epic fantasy (as should be done) but rather to the book they wish Martin had written, which raced the whole story to a tumultuous conclusion.  But aren't we all going to be bitterly disappointed after the last volume appears that there won't be any more?  Let's enjoy it while it lasts."}, {"reviewerID": "A1IDURMA722EOM", "asin": "0007386648", "reviewText": "my wife read this for her bookclub and loved it. I wasn't surprised, as I've found most of Hillenbrand's books to be solidly written and well researched. My wife began to realize how little she really knew about the culture of pre-WWII Europe (from the Olympics part of the book) and of the Pacific front (her father drove a tank through North Africa and Southern Europe)."}, {"reviewerID": "A1KZV0IRMKF3R3", "asin": "0006551807", "reviewText": "I'm glad I didn't read the reviews before reading the book, because I would have known the outcome of Gogol's relationships with women.  Since the book has a strict chronology with few digressions, it moves forward as life does: we don't know where it's headed and don't really want to know.Lahiri is a terrific writer, as every review attests.  Her greatest talent is in drawing her characters.  The reader feels like one of the gang at the endless string of parties that take place in this book. What's Gogol's email address? I want to find out how his mother's doing and wish him well.If you like Namesake, try Brick Lane by Monica Ali.  It's another Bengali family saga, set in London, with political resonance.  And Lahiri's short stories are gems."}, {"reviewerID": "A3J5CM842V51NC", "asin": "0007157169", "reviewText": "Lewis declares this not to be an allegory, but if you have any knowledge of the Biblical account of Creation and the Fall of man, you cannot help but draw parallels.A fiction of a giant \"what if\" in the Christian world, that would be enjoyable for anyone to read, Christian or not.Thought-provoking if you want it to be, pleasant fiction still if you aren't interested in putting deep thoughts into it.It was fascinating and hard to put down. Highly recommend."}, {"reviewerID": "A2ENPXEFW1ES4H", "asin": "0028631412", "reviewText": "I have previous editions of this book which I found initially helpful but this \" updated\" one is hardly that.  It still lists stores that closed 6 years ago!!!!!  The author has not done her research recently and it is reflected by inaccurate data causing shopping angst!"}, {"reviewerID": "A3CCZBWCMOXMS6", "asin": "0006514359", "reviewText": "I must preface my remaks with two facts. First I have read every one of Jack Higgins books and two I always buy them when they come out, I don't wait for the deep discount.That being said, Mr Higgins has always  written wonderful adventure books without the need for graphic sexual  descriptions or terrible violance, just what was needed to make the plot  work. I am by far no prude I love descriptive books.Day of Reckoning is  so sad. Here is an author who has had it all. He should have quit period.  He lumps all the characters from his previous book into a series of  impossible plots. They happen so fast that they make no sense. Had I not  read his other books all these characters would be meaningless, he  introduces them with, I guess, the premises that the reader has read all  his books. There are so many new characters that the reader can't remember  who goes with what. Irish, English, Maffia, American, Arab, Jew and so  forth. They just keeping turning up.The saddest is the lack of skill in  the plot and the horrible dialogue that is all through the book. You get  the impression that he wants it over, I don't blame him. Who could not  figure out who wins and who loses in each mini adventure. One  &quot;hero&quot; gets shot in the arm other then that the good guys always  win.The first chapter doesn't make sense in relation to the book. Why  is it there?Please don't waste your money and encourge Mr Higgins to  write any more. For me it is like losing an old friend.I saw how fast it  hit the best seller list and his name was what did that not the book. That  is the advantage of fame, it's too bad he used his to sell this disaster. I  am sure that his reputation was the mittigating factor with his publisher."}, {"reviewerID": "A184K71GMS0COC", "asin": "0007167040", "reviewText": "Not me. At least that's what I thought when I spotted the first review for this book and glanced at it briefly, assuming this was just some oddity, getting attention simply because it was  different.I was wrong. I bought the book after accidentally hearing the author interviewed on TV. Her remarks whetted my appetite. This was no ordinary racehorse, and his story was no ordinary story. If Seabiscuit had indeed attracted more media coverage in his prime than any other single identity -- even surpassing FDR -- there must be something really special about the horse and his achievements. After a couple of hints, the book appeared as a Father's Day gift.It reads like a novel -- a very exciting novel. In fact I could almost not put it down. Seabuscuit's story is not just the story of a champion thoroughbred. It's a cinderella story, an underdog saga, a tale of irrepressible talent and unbelievable accomplishments against great obstacles. The author skillfully interweaves the events of Seabiscuit's life with the lives of his owner, his trainer and the two jockies that rode him to dozens of track records against some of the finest thoroughbreds in the history of American racing. And just when the reader thinks he has experienced the most exciting moment in Seabiscuit's stunning career, the author takes us to an even more shining instant. Reading this book, you will be surprised at how often you find a lump in your throat or a tear in your eye.In the movie they will surely make from this incredible book, the story will undoubtedly focus more on the people than the horse, almost certainly hinging on Red Pollard, the jockey who rode Seabuscuit to most of his legendary wins. I envision Gene Hackman as Charles Howard, the multimillionaire owner who plucked Seabiscuit from obscurity, and either Paul Newman or Robert Redford as Tom Smith, the silent and ingenious horsewhisperer-like trainer responsible for the nurturing of Seabiscuit's indominatable spirit. Red Pollard is my casting dilemma. I can't imagine who might play this eccentric character known to quote often and extensively from the works of Ralph Waldo Emerson and who survived the brutal and dangerous circumstances of a jockey's existence, struggling back from permanently crippling, nearly fatal injuries to share Seabiscuit's greatest glory.But don't wait for the movie. Buy the book."}, {"reviewerID": "A35REQ284IMHI7", "asin": "0007228023", "reviewText": "Frank has a very engaging narrative style that really makes you feel inside of his head and life.  More really can not be said about an author.  It is what everyone strives for but few really achieve.  Perhaps what makes his writing so authentic is that he is very candid about his failings as well as his successes."}, {"reviewerID": "A25B5DRU8UQQD", "asin": "0007444117", "reviewText": "I loved the first two books on this series but the third one seemed to read much slower and I was not fond of the author killing off one of her main characters. I also had troubles differentiating between who was speaking. Tris and Four seemed too similar to me."}, {"reviewerID": "A1IIX764GG3WNZ", "asin": "0002007770", "reviewText": "Jacob Jankowski is a 93-year old man in a nursing home, and very cantankerous. The circus has come to the nursing home residents, and this takes Jacob back in time in the book as he tells his story. The book goes back and forth between the past and present tense.When Jake's parents die unexpectedly in a tragic accident,he is 23-years old and lost now. The house was taken away since unbeknowst to Jake, his parents had been in debt, and the house is taken away, and all because his father couldn't let the animals go hungry. He and Jake were in a veterinary practice together, and now it's all gone. Jake, not knowing what to do, went back to school to finish his final exams. He walks out in the middle of it though, and goes toward the train tracks. He climbs aboard a circus train unknowingly, which is the Benzini Brothers, The Greatest Show on Earth. From then on, his life changes forever.Camel is the older man that takes Jake under his wing, and shows him the ropes more or less. He is given the job of cleaning up after the animals, and later acted as a vet. Jake is introduced to Walter, and at first Walter deeply resents Jake at first, and having to share his quarters with him. But when Jake saves his pet Queenie, the two strike a friendship.The boss, August is a hateful cruel man. When an elephant, Rosie is brought in to the mix, August is absolutely sadistic to that poor animal. Jake saves Rosie from being killed by August more than a few times in the book.And the other part of the story is Marlena, August's sweet wife. Jake falls in love with her almost immediately, and knows that Marlena is miserable with her mentally ill husband. She falls for Jake as well, and when it is discovered that they are sneaking away by August, a horrible disaster strikes, and Jake almost doesn't survive.The book comes to an earth-shattering climax and has quite the ending which is a surprise."}, {"reviewerID": "ANDIM9VNUG0RB", "asin": "0007444117", "reviewText": "This finale to an amazing trilogy follows its counterparts (Ex. the Hunger Games, Delirium, and Matched trilogies) by finishing up with a novel more concerned with its politics than its characters.  Roth, like several of the others, seems determined to avoid a happy ending that the reader can celebrate.  Also, the pace to this novel is much slower than the previous two, dragging in parts.  Still, if you've read the first two, you won't be able to resist the temptation of knowing how it all ends!"}, {"reviewerID": "A3NFO8QXWEF6D1", "asin": "0007442920", "reviewText": "Insurgent carries the story further and keeps the reader's attention from start to finish. I can't wait to read the next one."}, {"reviewerID": "A22V0M0977JQAP", "asin": "0007444117", "reviewText": "The writing was horrible. The story line was boring. The ending ruined the entire trilogy. Left a really bad taste in my mouth."}, {"reviewerID": "A13P77QPZ4NWUL", "asin": "0007410956", "reviewText": "I am half-way through and bored to death.  If someone doesn't get eaten by a cannibal soon I will quit reading! :)"}, {"reviewerID": "A2S0DYAO4NUK65", "asin": "0026009102", "reviewText": "Yet again, a story about the ideal man.  Yet again, a tale of a hero.  And again, individual versus society.  Been there, done that.But never with these epic proportions, and never as well written as this.Like the rest of Rand's novels, you either love it or hate it.  I just started reading Rand this year, and although I disagree with her philosophy in many areas, I have to revere her brilliant, bitter writing style; it made her book live and breathe in a way that few other books do.  I found the character of Roark to be decent, but I think that too much emphasis was placed on his cold selfishness and his indifference toward most people.  Dominique Francon and Gail Wynand, on the other hand, were much more human and convincing.  The philosophy when Roark was on trial could be cut, but ultimately, this novel casts a ray of hope when there seems to be none."}, {"reviewerID": "AYMMV2GC0U2QC", "asin": "0007442920", "reviewText": "I loved this book and think it is one of the best books I've eve read!!!CANT WAIT FOR THE NEXT BOOK"}, {"reviewerID": "A3RQB3L2UB046I", "asin": "0007442920", "reviewText": "I want more!!! I read the whole series in a week and hope that there will be more in the future from Veronica Roth!!!"}, {"reviewerID": "AR2SMWMB81NVP", "asin": "0007333994", "reviewText": "I was pleasantly surprised by this book. Having read several Fey-themed books, I thought it may be rather adolescent. However, this is not a Young Adult book (though I'm sure many YAs would like it a lot). I thoroughly enjoyed how skillfully historical elements were woven in throughout the story. Also, the author created characters, such as Niall, that experience an array of emotions that make them easy with which to relate. One of the primary themes is that of adapting to constant change, which I found to be timely & relevant given today's society. I will definitely be recommending this thought-provoking book to others as well as reading the next one in the series."}, {"reviewerID": "A202FGBQHO5638", "asin": "0006499163", "reviewText": "I made a serious mistake when I first read the Aubrey/Maturin books: I  read them out of sequence. Thus, when I first came to &quot;Post  Captain&quot; which is the 2nd in the series &amp; sets up many themes in  the novels to come, I already knew how dilemmas would be resolved. This  contributed to a feeling of irritation the first time I read it, especially  as much occurs on land in a Jane Austen-esque style.This time around I  am re-reading all 20 books in order, &amp; I find &quot;Post Captain&quot;  to have many nuances I overlooked the first time. It is one of the funniest  books in the series. There are some scenes (such as Maturin's first arrival  on deck of Aubrey's acting command the &quot;Lively&quot;) in which  O'Brian's dry humor will have you in stitches. Of course this is also the  novel in which Maturin contributes his much-quoted explanation for the term  &quot;dog-watch&quot;. The consequences of Pulling's celebration on being  made lieutanant are hysterical; but in the dense plotting of &quot;Post  Captain&quot; these moments are leavening to the sense of a lee-shore  looming in the distance.If you are currently reading the Aubrey/Maturin  novels, you don't need a recommendation to get &quot;Post Captain&quot;.  Just take my advice &amp; don't read this book out of sequence if possible.  If you are thinking of starting this series, do so with &quot;Master &amp;  Commander&quot;. You'll be happy you did!"}, {"reviewerID": "AQR2XU3HEXDVZ", "asin": "0007230206", "reviewText": "Although well done and interesting, this book in no way measures up to all the hype. Others have gotten a lot more detailed in their reviews than I have the time or inclination for. I must say, however, that the one quirk that really bothered me about this book was that Mantel rarely identifies her thinker or speaker; the narrative always says \"he,\" which can refer to anyone in the scene. Or even if there is a name attached to a thought or dialogue, it's invariably Thomas, Henry, or William. And pretty much everyone back in those days was named one of these three names. I have no idea if this lack of clarity is a pretension, \"craft,\" or just shoddy writing. But it is unendingly, maddeningly cumbersome to have to go back and reread to try to figure out who is speaking or thinking. After a while, I just decided to relax and not worry about assigning narrative to character. Go figure.That said, the book is arresting, enjoyable, and entertaining. The time period is always fascinating, and one certainly gets a different portrait of Cromwell and More than heretofore offered. How much of the portrait is apocryphal or fabricated, I cannot say. In sum, a good read, but no masterpeice, so do not expect one."}, {"reviewerID": "A2I54AR29TPRK3", "asin": "0007263686", "reviewText": "\"Winston's War, Churchill, 1940-1945,\" written by Max Hastings, Published by Alfred A. Knopf, New York, 2009.Max Hastings is one of the best military historians writing today. His book \"OVERLORD\" is one of the classic accounts of the Allies fighting in Europe from the Normandy invasion through the Falaise Gap in August 1944. Mr. Hastings has been able to take a mountain of factual information from his research and weave it into a seamless narrative of some historical signifiance. It worked in \"OVERLORD;\" it does not work here.The problem is Winston S. Churchill. The British Prime Minister and Minister of Defense was a man of great strategic vision. His speeches and his writing after Dunkirk are widely credited with saving Great Britain in her hour of need. He saw the threat Hitler's Germany presented to his country before anyone else; and he suffered for it politically. Yet during the war Churchill's strategic vision deserted him so many times that Hastings' compliments seem forced.  He wrote, \"Churchill's grand vision of the war was superb.\" p. 360. Resumes that begin with Gallipoli and end up defending the bloody Italian mountain campaign will not win you many jobs as a strategist. Events in Churchill's life that Hastings is forced to write about often undermine the story Hastings wants to tell of the greatest ever British political leader.One minor correction, the picture between pages 430 and 431 of Admiral William D Leahy, Alan Brooke, Hastings Ismay and George Marshall incorrectly lists U.S. Admiral Ernest King as Admiral Leahy. Note to the editors: Admiral William Leahy is authorized to wear the right shoulder \"aiguillette\" as an aide to President Roosevelt; Admiral King is not.Two notes on Allied strategy. First, Churchill insisted until virtually the end of the war that the British Army in Europe be granted the highest strategic and logistic priority. Churchill's views were eagerly followed by British C.I.G.S. Alan Brooke and British 21st Army Group Commander, Field Marshal Bernard L. Montgomery. Hastings wrote, \"British attempts to ignore their own impoverishment and retain a giant's role in the world inspired pity among their American friends, contempt among their American enemies.\" p. 419. It mattered little what most Americans thought. Only General Dwight Eisenhower's opinion really mattered and he usually sided with the British, at least until March 28, 1945. One gets a picture of General Eisenhower standing on the banks of the Rhine River in March 1945 with C.I.G.S. Alan Brooke, literally begging the British Field Marshal for a chance to \"disperse\" his forces, to unleash the Bradley's American Army into central Germany. Brooke agreed but it was far too little, far too late. There were only 40 odd days left in the war. In \"Armageddon,\" Hastings wrote, \"Montgomery's most serious weakness ... stemmed from a refusal to acknowledge that in north-west Europe it was now essential for the British to defer to the overwhelming dominance of the United States (Army).\" p. 27. Montgomery never did force himself to accept the obvious, but that was not his job. British wartime strategy came from the top down. It came from Winston Churchill and his Chiefs of Staff and they routinely insisted on fighting the Americans tooth and nail for logistic and strategic priority for the British Army in Europe.Second, the Italian campaign was the longest running argument between the Anglo-American Allies. The British supported it and tried to get more U.S. soldiers and ships committed to the campaign. The Americans disliked the whole Mediterranean theater and especially the campaign in Italy because of the terrible mountainous terrain. British official Harold Macmillan wrote, \"The more one sees of this (Italian) peninsula, the less suited it seems for modern military operations.\" p. 357. This was obvious to any first year officer cadet. But it was apparently not obvious to Prime Minister Winston Churchill and his military advisors who berated the Americans time and again over operations in Italy. Two of the strongest proponents of continued operations in Italy were C.I.G.S. Alan Brooke and Mediterranean Theater Commander Field Marshal Sir Henry Wilson. But we now know that they did not support operations in Italy at all and, in fact, were of the opposite view. Alan Brooke told U.S. historian Forrest Pogue, \"... There is no doubt that Winston had a Balkan liking ... and he used to make matters rather difficult for me with Marshall with statements he would make, which Marshall would often think were inspired by me and they were not ... I couldn't go to him (Marshall) and say I don't agree with a word my Prime Minister is saying.\" C.  Catherwood, Winston Churchill, p. 260. And Sir Henry Wilson said, \"... I knew that strategically that was the only way (Southern France)... None of us liked the offensive against Italy really, against those mountains.\" C. Catherwood, p. 261. British Intelligence Officer Sir Kenneth Strong confirms Wilson's statement. \"Churchill's obsession with the \"underbelly\" theory has always struck me as a strategic aberration. General Sir Henry Maitland Wilson ... told me early in 1944 that he also favored the American view, but said that it was difficult for him to oppose the Prime Minister's policy.\" Sir Kenneth Strong, Intelligence at the Top, p. 130. Allied strategy in Italy was being determined, not by the best military minds available, but by an amateur politician bent on getting his own way, as Alan Brooke once put it,'to spite the Americans.'At conferences in Cairo and Teheran Churchill chose to fight the Overlord battle with the Americans just one more time. It was a huge mistake. Presidential advisor Harry Hopkins had warned Churchill to back off or be prepared to go it alone at Teheran. Churchill refused to listen and paid the price. Roosevelt had tired of listening to Churchill's rants. He refused numerous requests for private meetings with the British Prime Minister. Churchill liked to blame Roosevelt's casual socializing for his lack of free time, but Hastings correctly points out \"... that such evasion(s) reflected policy rather than 'mischances.'\" p. 348.Churchill had overplayed the British hand throughout WW II. He got the headlines he wanted from the British press and this in turn inspired a reasonable war effort from the British people. Hastings wrote, \"... the United States, its leaders and people alike still overestimated the wealth of Churchill's nation. Few grasped the extent of its moral, strategic and financial exhaustion.\" p. 443. In Bernard L. Montgomery, the British people had a brilliant field marshal who never lost a battle, and whose battles all went exactly as he had planned them. Financially, there was seldom the slightest hint of long-term British fiscal doom covered by the press during the war. British and Americans shared an overly optimistic future for the British Empire and the British economy. These opinions were not divined by reading the tea leaves, but by reading British newspapers.It was all part of Prime Minister Winston S. Churchill's war winning strategy. British economic and military power were hyped and exaggerated far beyond their actual war-time performances. Neither American military or economic aid was seen as critical by the average British subject. \"... Only a third of those (British) questioned held favorable views of Americans... Americans were actually held in lower esteem than Italians. Yet nine of ten Britishers thought well of Russia and the Russians.\" Peter Lyon, Eisenhower, p. 278.Hastings writes, \"There is an escapable pathos about Churchill's predicament in the last year of the war... His engagement with armies became ... that of a tourist, because he could no longer much influence their movements.\" p. 482. Yet on March 31, 1945 Churchill wrote Eisenhower a letter complaining bitterly about Eisenhower's decision to reinforce Bradley with Simpson's Ninth U.S. Army which had been attached to Montgomery's 12th British Army Group. British complaints went all the way to the Combined Chiefs in Washington which forced George Marshall to ask Eisenhower to explain his decisions. There were barely 40 days left in the war. The Americans hoped to get in at least one full-scale offensive before the war ended, if they could just get the British out of the way. The last large American offensive which had full British approval went back to Operation Cobra in the Carentan at the end of July 1944. Montgomery usually gets blamed for his intransigence with the Americans, but the real culprit was P.M. Churchill and his refusal to see a reduced role for the dying British Empire in a post-war world. Max Hastings is forced to struggle with Churchill's flawed strategic vision throughout his book. The reader keeps his fingers crossed, but he already knows the ending will not be a happy one."}, {"reviewerID": "A26MVLLMLG3Q8B", "asin": "0006514006", "reviewText": "I did not want to put this book down. It is not a real page turner because you want to find out what happens in the story (the story of Henry VIII is well known), but you immediately empathize with Mary Boleyn and want her to find her own way in a world where women are not valued except for their ability to further the family's ambitions for wealth and power or create a son for Henry VIII.The Other Boleyn Girl is narrated first person by Mary Boleyn. The characters are well developed for the three Bolyen siblings - Mary, Ann and George. Although all three of them are thrust into the crazy inner workings of the court of Henry VIII, they all have different challenges and reactions to their own family's ambitions as well as the greed, corruption, immorality and narcissism of the court of Henry VIII.It's interesting to see the story of Anne Boleyn from a different perspective and the author does a great job of telling the story through the eyes of the less infamous sister. This book is of course fiction, but it brings this time in history to life in a very entertaining way.This is the first book I have ready by Philippa Gregory, but I am now a fan. I am looking forward to reading other books written by her."}, {"reviewerID": "A1XRQ6YJ7HXQFQ", "asin": "0007269854", "reviewText": "This novel deals with life in a small Swedish town, and events a quarter of a century earlier which ended in at least two deaths.  A woman, her wrists slashed, bleeds to death in her bathtub, covered with ice, preserving her body until it is discovered.  Subsequently, an outcast ne'er-do-well artist, her boyhood friend and possible lover, is found hanging in his flat.  Both apparent suicides are subsequently determined to be murders, and therein lies the beginning of a tale.The book is nominally a murder mystery.  However, so many extraneous sub-plots and characters clutter it up that the reader becomes bogged down in unnecessary verbiage and unrelated information, slowing down the reading and detracting from the otherwise excellent story.  If only a sharper pencil or even a re-write had been applied to the novel, it would have been far superior to the book as published.  Nevertheless, it is still worth reading because the main plot and the unfolding of the investigation are well-done.  Which is more than can be said for the character development.Writer Erica Falck seems merely a foil in place of the author, and her new boyfriend, Patrick Hedstrom, is more wooden than alive.  As for the police superintendent, he's not even funny, as it appears he is supposed to be.  Most of the other characters merely fill in blanks.  Given the fact that Lackberg has written seven books that have dominated Stockholm bestseller lists, these observations surely are surprising.  That said, the novel is recommended."}, {"reviewerID": "AY1K52XASRNTQ", "asin": "0007444117", "reviewText": "Forgive me for being mad after reading this book but I bet you that your reaction will be the same too! After reading the first two book and completely loved it, I expected the finale will be explosive with a great ending! This book left me empty, distraught, and angry! Not a way to finish this Miss Roth!"}]